; ModuleID = 'cksum.bc.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.blake2b_param__ = type { i8, i8, i8, i8, i32, i32, i32, i8, i8, [14 x i8], [16 x i8], [16 x i8] }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.sha1_ctx = type { i32, i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.sha256_ctx = type { [8 x i32], [2 x i32], i64, [32 x i32] }
%struct.sha512_ctx = type { [8 x i64], [2 x i64], i64, [32 x i64] }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

!36 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!39 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!40 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !42, line: 46, baseType: !6, size: 32, elements: !43)
!42 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!44 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!45 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!46 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!47 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!48 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!49 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!50 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!51 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!52 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!55 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !58, file: !57, line: 187, baseType: !6, size: 32, elements: !67)
!57 = !DIFile(filename: "../src/system.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!58 = distinct !DISubprogram(name: "select_plural", scope: !57, file: !57, line: 183, type: !59, scopeLine: 184, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !66)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !62}
!61 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !63, line: 102, baseType: !64)
!63 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !65, line: 73, baseType: !61)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!66 = !{}
!67 = !{!68}
!68 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 45, baseType: !6, size: 32, elements: !71)
!70 = !DIFile(filename: "../lib/fadvise.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!75 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!77 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!78 = !{!79, !82, !84, !85, !86, !88, !90, !91}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !87, line: 46, baseType: !61)
!87 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!92 = !{!93, !96, !98, !100, !0, !102, !116, !122, !128, !130, !132, !134, !136, !138, !140, !142, !144, !146, !150, !158, !165, !167, !229}
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 175, type: !95, isLocal: true, isDefinition: true)
!95 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 178, type: !86, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 181, type: !86, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "digest_length", scope: !2, file: !3, line: 209, type: !62, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 364, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 3840, elements: !114)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !107, line: 50, size: 256, elements: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!108 = !{!109, !110, !111, !113}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !107, line: 52, baseType: !79, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !106, file: !107, line: 55, baseType: !90, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !106, file: !107, line: 56, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !106, file: !107, line: 57, baseType: !90, size: 32, offset: 192)
!114 = !{!115}
!115 = !DISubrange(count: 15)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "algorithm_types", scope: !2, file: !3, line: 296, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 352, elements: !120)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!120 = !{!121}
!121 = !DISubrange(count: 11)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "algorithm_args", scope: !2, file: !3, line: 291, type: !124, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 768, elements: !126)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!126 = !{!127}
!127 = !DISubrange(count: 12)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "cksum_algorithm", scope: !2, file: !3, line: 318, type: !5, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "algorithm_specified", scope: !2, file: !3, line: 317, type: !95, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 185, type: !95, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 189, type: !95, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 195, type: !95, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 192, type: !95, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 199, type: !95, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "digest_delim", scope: !2, file: !3, line: 205, type: !89, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "algorithm_tags", scope: !2, file: !3, line: 303, type: !124, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "algorithm_bits", scope: !2, file: !3, line: 308, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 384, elements: !126)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "bin2hex", scope: !152, file: !3, line: 1109, type: !155, isLocal: true, isDefinition: true)
!152 = distinct !DISubprogram(name: "digest_check", scope: !3, file: !3, line: 1024, type: !153, scopeLine: 1025, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !66)
!153 = !DISubroutineType(types: !154)
!154 = !{!95, !79}
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 128, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 16)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "max_tag_len", scope: !160, file: !3, line: 670, type: !86, isLocal: true, isDefinition: true)
!160 = distinct !DISubprogram(name: "algorithm_from_tag", scope: !3, file: !3, line: 667, type: !161, scopeLine: 668, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !66)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !84}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !87, line: 35, baseType: !164)
!164 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 202, type: !90, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "cksumfns", scope: !2, file: !3, line: 319, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 704, elements: !120)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "sumfn", file: !171, line: 7, baseType: !172)
!171 = !DIFile(filename: "../src/sum.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!90, !175, !85, !228}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !177, line: 7, baseType: !178)
!177 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !179, line: 49, size: 1728, elements: !180)
!179 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !196, !198, !199, !200, !202, !203, !205, !209, !212, !214, !217, !220, !221, !222, !223, !224}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !178, file: !179, line: 51, baseType: !90, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !178, file: !179, line: 54, baseType: !84, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !178, file: !179, line: 55, baseType: !84, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !178, file: !179, line: 56, baseType: !84, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !178, file: !179, line: 57, baseType: !84, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !178, file: !179, line: 58, baseType: !84, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !178, file: !179, line: 59, baseType: !84, size: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !178, file: !179, line: 60, baseType: !84, size: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !178, file: !179, line: 61, baseType: !84, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !178, file: !179, line: 64, baseType: !84, size: 64, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !178, file: !179, line: 65, baseType: !84, size: 64, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !178, file: !179, line: 66, baseType: !84, size: 64, offset: 704)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !178, file: !179, line: 68, baseType: !194, size: 64, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !179, line: 36, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !178, file: !179, line: 70, baseType: !197, size: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !178, file: !179, line: 72, baseType: !90, size: 32, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !178, file: !179, line: 73, baseType: !90, size: 32, offset: 928)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !178, file: !179, line: 74, baseType: !201, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !65, line: 152, baseType: !164)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !178, file: !179, line: 77, baseType: !91, size: 16, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !178, file: !179, line: 78, baseType: !204, size: 8, offset: 1040)
!204 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !178, file: !179, line: 79, baseType: !206, size: 8, offset: 1048)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 1)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !178, file: !179, line: 81, baseType: !210, size: 64, offset: 1088)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !179, line: 43, baseType: null)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !178, file: !179, line: 89, baseType: !213, size: 64, offset: 1152)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !65, line: 153, baseType: !164)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !178, file: !179, line: 91, baseType: !215, size: 64, offset: 1216)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !179, line: 37, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !178, file: !179, line: 92, baseType: !218, size: 64, offset: 1280)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !179, line: 38, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !178, file: !179, line: 93, baseType: !197, size: 64, offset: 1344)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !178, file: !179, line: 94, baseType: !85, size: 64, offset: 1408)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !178, file: !179, line: 95, baseType: !86, size: 64, offset: 1472)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !178, file: !179, line: 96, baseType: !90, size: 32, offset: 1536)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !178, file: !179, line: 98, baseType: !225, size: 160, offset: 1568)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 160, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 20)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "cksum_output_fns", scope: !2, file: !3, line: 333, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 704, elements: !120)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "digest_output_fn", file: !3, line: 212, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !79, !90, !82, !95, !89, !95, !62}
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !238, file: !239, line: 27, type: !275, isLocal: true, isDefinition: true)
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !240, retainedTypes: !249, globals: !259, splitDebugInlining: false, nameTableKind: None)
!239 = !DIFile(filename: "../src/blake2/blake2b-ref.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!240 = !{!241}
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !242, line: 48, baseType: !6, size: 32, elements: !243)
!242 = !DIFile(filename: "../src/blake2/blake2.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!243 = !{!244, !245, !246, !247, !248}
!244 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128, isUnsigned: true)
!245 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64, isUnsigned: true)
!246 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64, isUnsigned: true)
!247 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16, isUnsigned: true)
!248 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16, isUnsigned: true)
!249 = !{!250, !252, !255, !85, !257}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !253, line: 24, baseType: !254)
!253 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !65, line: 38, baseType: !89)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !253, line: 27, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !65, line: 45, baseType: !61)
!259 = !{!236, !260, !271}
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "memset_v", scope: !262, file: !263, line: 163, type: !266, isLocal: true, isDefinition: true)
!262 = distinct !DISubprogram(name: "secure_zero_memory", scope: !263, file: !263, line: 161, type: !264, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !238, retainedNodes: !66)
!263 = !DIFile(filename: "../src/blake2/blake2-impl.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!264 = !DISubroutineType(types: !265)
!265 = !{null, !85, !86}
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!85, !85, !90, !86}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !238, file: !239, line: 35, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 1536, elements: !274)
!274 = !{!127, !157}
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 512, elements: !277)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!277 = !{!278}
!278 = !DISubrange(count: 8)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "cksum_fp", scope: !281, file: !282, line: 156, type: !289, isLocal: true, isDefinition: true)
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !283, globals: !288, splitDebugInlining: false, nameTableKind: None)
!282 = !DIFile(filename: "../src/cksum.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!283 = !{!284, !79, !285, !88}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !253, line: 26, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !65, line: 42, baseType: !6)
!288 = !{!279}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!95, !292, !326, !228}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !177, line: 7, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !179, line: 49, size: 1728, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !294, file: !179, line: 51, baseType: !90, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !294, file: !179, line: 54, baseType: !84, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !294, file: !179, line: 55, baseType: !84, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !294, file: !179, line: 56, baseType: !84, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !294, file: !179, line: 57, baseType: !84, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !294, file: !179, line: 58, baseType: !84, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !294, file: !179, line: 59, baseType: !84, size: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !294, file: !179, line: 60, baseType: !84, size: 64, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !294, file: !179, line: 61, baseType: !84, size: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !294, file: !179, line: 64, baseType: !84, size: 64, offset: 576)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !294, file: !179, line: 65, baseType: !84, size: 64, offset: 640)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !294, file: !179, line: 66, baseType: !84, size: 64, offset: 704)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !294, file: !179, line: 68, baseType: !194, size: 64, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !294, file: !179, line: 70, baseType: !310, size: 64, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !294, file: !179, line: 72, baseType: !90, size: 32, offset: 896)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !294, file: !179, line: 73, baseType: !90, size: 32, offset: 928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !294, file: !179, line: 74, baseType: !201, size: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !294, file: !179, line: 77, baseType: !91, size: 16, offset: 1024)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !294, file: !179, line: 78, baseType: !204, size: 8, offset: 1040)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !294, file: !179, line: 79, baseType: !206, size: 8, offset: 1048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !294, file: !179, line: 81, baseType: !210, size: 64, offset: 1088)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !294, file: !179, line: 89, baseType: !213, size: 64, offset: 1152)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !294, file: !179, line: 91, baseType: !215, size: 64, offset: 1216)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !294, file: !179, line: 92, baseType: !218, size: 64, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !294, file: !179, line: 93, baseType: !310, size: 64, offset: 1344)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !294, file: !179, line: 94, baseType: !85, size: 64, offset: 1408)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !294, file: !179, line: 95, baseType: !86, size: 64, offset: 1472)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !294, file: !179, line: 96, baseType: !90, size: 32, offset: 1536)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !294, file: !179, line: 98, baseType: !225, size: 160, offset: 1568)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !63, line: 74, baseType: !61)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "crctab", scope: !330, file: !331, line: 3, type: !333, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, globals: !332, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "../src/crctab.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!332 = !{!328}
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 131072, elements: !335)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!335 = !{!278, !336}
!336 = !DISubrange(count: 256)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "Version", scope: !339, file: !340, line: 2, type: !79, isLocal: false, isDefinition: true)
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, globals: !341, splitDebugInlining: false, nameTableKind: None)
!340 = !DIFile(filename: "src/version.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!341 = !{!337}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !344, file: !345, line: 67, type: !349, isLocal: false, isDefinition: true)
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !345, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !346, retainedTypes: !347, globals: !348, splitDebugInlining: false, nameTableKind: None)
!345 = !DIFile(filename: "../lib/argmatch.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!346 = !{!19}
!347 = !{!85, !79}
!348 = !{!342}
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !350, line: 61, baseType: !351)
!350 = !DIFile(filename: "../lib/argmatch.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "file_name", scope: !356, file: !357, line: 46, type: !79, isLocal: true, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !358, globals: !359, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "../lib/closeout.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!358 = !{!79}
!359 = !{!354, !360}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !356, file: !357, line: 56, type: !95, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "fillbuf", scope: !364, file: !365, line: 61, type: !369, isLocal: true, isDefinition: true)
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !366, globals: !368, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "../lib/md5.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!366 = !{!84, !79, !367}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !63, line: 90, baseType: !61)
!368 = !{!362}
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 512, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 64)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "fillbuf", scope: !374, file: !375, line: 47, type: !369, isLocal: true, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !376, globals: !377, splitDebugInlining: false, nameTableKind: None)
!375 = !DIFile(filename: "../lib/sha1.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!376 = !{!84, !79, !367, !286}
!377 = !{!372}
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "fillbuf", scope: !380, file: !381, line: 46, type: !369, isLocal: true, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !366, globals: !382, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "../lib/sha256.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!382 = !{!378, !383}
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "sha256_round_constants", scope: !380, file: !381, line: 270, type: !385, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 2048, elements: !370)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "fillbuf", scope: !389, file: !390, line: 46, type: !401, isLocal: true, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !391, globals: !394, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "../lib/sha512.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!391 = !{!392, !84, !79, !367}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !393, line: 37, baseType: !257)
!393 = !DIFile(filename: "../lib/u64.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!394 = !{!387, !395}
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "sha512_round_constants", scope: !389, file: !390, line: 271, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 5120, elements: !399)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!399 = !{!400}
!400 = !DISubrange(count: 80)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 1024, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 128)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "fillbuf", scope: !406, file: !407, line: 59, type: !369, isLocal: true, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !366, globals: !408, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "../lib/sm3.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!408 = !{!404, !409}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "sm3_round_constants", scope: !406, file: !407, line: 233, type: !385, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "exit_failure", scope: !413, file: !414, line: 24, type: !416, isLocal: false, isDefinition: true)
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, globals: !415, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "../lib/exitfail.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!415 = !{!411}
!416 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !90)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "power_letter", scope: !419, file: !420, line: 36, type: !447, isLocal: true, isDefinition: true)
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !421, retainedTypes: !435, globals: !436, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "../lib/human.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!421 = !{!422, !33}
!422 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 43, baseType: !6, size: 32, elements: !424)
!423 = !DIFile(filename: "../lib/human.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434}
!425 = !DIEnumerator(name: "human_ceiling", value: 0, isUnsigned: true)
!426 = !DIEnumerator(name: "human_round_to_nearest", value: 1, isUnsigned: true)
!427 = !DIEnumerator(name: "human_floor", value: 2, isUnsigned: true)
!428 = !DIEnumerator(name: "human_group_digits", value: 4, isUnsigned: true)
!429 = !DIEnumerator(name: "human_suppress_point_zero", value: 8, isUnsigned: true)
!430 = !DIEnumerator(name: "human_autoscale", value: 16, isUnsigned: true)
!431 = !DIEnumerator(name: "human_base_1024", value: 32, isUnsigned: true)
!432 = !DIEnumerator(name: "human_space_before_unit", value: 64, isUnsigned: true)
!433 = !DIEnumerator(name: "human_SI", value: 128, isUnsigned: true)
!434 = !DIEnumerator(name: "human_B", value: 256, isUnsigned: true)
!435 = !{!82}
!436 = !{!417, !437, !442}
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "block_size_args", scope: !419, file: !420, line: 398, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 192, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 3)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !419, file: !420, line: 399, type: !444, isLocal: true, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 64, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 2)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 72, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 9)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "program_name", scope: !452, file: !453, line: 33, type: !79, isLocal: false, isDefinition: true)
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !454, globals: !455, splitDebugInlining: false, nameTableKind: None)
!453 = !DIFile(filename: "../lib/progname.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!454 = !{!85, !84}
!455 = !{!450}
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !458, file: !459, line: 78, type: !501, isLocal: false, isDefinition: true)
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !460, retainedTypes: !466, globals: !467, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "../lib/quotearg.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!460 = !{!19, !461, !41}
!461 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !20, line: 242, baseType: !6, size: 32, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!464 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!465 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!466 = !{!90, !91, !86, !79}
!467 = !{!456, !468, !474, !484, !486, !490, !497, !499}
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !458, file: !459, line: 94, type: !470, isLocal: false, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 320, elements: !472)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!472 = !{!473}
!473 = !DISubrange(count: 10)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !458, file: !459, line: 1044, type: !476, isLocal: false, isDefinition: true)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !459, line: 58, size: 448, elements: !477)
!477 = !{!478, !479, !480, !482, !483}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !476, file: !459, line: 61, baseType: !19, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !476, file: !459, line: 64, baseType: !90, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !476, file: !459, line: 68, baseType: !481, size: 256, offset: 64)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !277)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !476, file: !459, line: 71, baseType: !79, size: 64, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !476, file: !459, line: 74, baseType: !79, size: 64, offset: 384)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !458, file: !459, line: 109, type: !476, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "slot0", scope: !458, file: !459, line: 834, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 2048, elements: !489)
!489 = !{!336}
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "slotvec", scope: !458, file: !459, line: 837, type: !492, isLocal: true, isDefinition: true)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !459, line: 826, size: 128, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !493, file: !459, line: 828, baseType: !86, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !493, file: !459, line: 829, baseType: !84, size: 64, offset: 64)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "nslots", scope: !458, file: !459, line: 835, type: !90, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "slotvec0", scope: !458, file: !459, line: 836, type: !493, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 704, elements: !120)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !504, file: !505, line: 26, type: !507, isLocal: false, isDefinition: true)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, globals: !506, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "../lib/version-etc-fsf.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!506 = !{!502}
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 376, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 47)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !512, file: !513, line: 509, type: !90, isLocal: true, isDefinition: true)
!512 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !513, file: !513, line: 488, type: !514, scopeLine: 489, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !516, retainedNodes: !66)
!513 = !DIFile(filename: "../lib/fcntl.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!514 = !DISubroutineType(types: !515)
!515 = !{!90, !90, !90}
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, globals: !517, splitDebugInlining: false, nameTableKind: None)
!517 = !{!510}
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !520, globals: !522, splitDebugInlining: false, nameTableKind: None)
!519 = !DIFile(filename: "../src/blake2/b2sum.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!520 = !{!521}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!522 = !{!523}
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "buffer_length", scope: !525, file: !519, line: 91, type: !562, isLocal: true, isDefinition: true)
!525 = distinct !DISubprogram(name: "blake2b_stream", scope: !519, file: !519, line: 86, type: !526, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !518, retainedNodes: !66)
!526 = !DISubroutineType(types: !527)
!527 = !{!90, !528, !85, !86}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !177, line: 7, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !179, line: 49, size: 1728, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !530, file: !179, line: 51, baseType: !90, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !530, file: !179, line: 54, baseType: !84, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !530, file: !179, line: 55, baseType: !84, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !530, file: !179, line: 56, baseType: !84, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !530, file: !179, line: 57, baseType: !84, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !530, file: !179, line: 58, baseType: !84, size: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !530, file: !179, line: 59, baseType: !84, size: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !530, file: !179, line: 60, baseType: !84, size: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !530, file: !179, line: 61, baseType: !84, size: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !530, file: !179, line: 64, baseType: !84, size: 64, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !530, file: !179, line: 65, baseType: !84, size: 64, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !530, file: !179, line: 66, baseType: !84, size: 64, offset: 704)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !530, file: !179, line: 68, baseType: !194, size: 64, offset: 768)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !530, file: !179, line: 70, baseType: !546, size: 64, offset: 832)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !530, file: !179, line: 72, baseType: !90, size: 32, offset: 896)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !530, file: !179, line: 73, baseType: !90, size: 32, offset: 928)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !530, file: !179, line: 74, baseType: !201, size: 64, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !530, file: !179, line: 77, baseType: !91, size: 16, offset: 1024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !530, file: !179, line: 78, baseType: !204, size: 8, offset: 1040)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !530, file: !179, line: 79, baseType: !206, size: 8, offset: 1048)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !530, file: !179, line: 81, baseType: !210, size: 64, offset: 1088)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !530, file: !179, line: 89, baseType: !213, size: 64, offset: 1152)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !530, file: !179, line: 91, baseType: !215, size: 64, offset: 1216)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !530, file: !179, line: 92, baseType: !218, size: 64, offset: 1280)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !530, file: !179, line: 93, baseType: !546, size: 64, offset: 1344)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !530, file: !179, line: 94, baseType: !85, size: 64, offset: 1408)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !530, file: !179, line: 95, baseType: !86, size: 64, offset: 1472)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !530, file: !179, line: 96, baseType: !90, size: 32, offset: 1536)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !530, file: !179, line: 98, baseType: !225, size: 160, offset: 1568)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!563 = distinct !DICompileUnit(language: DW_LANG_C99, file: !564, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !565, retainedTypes: !566, globals: !567, splitDebugInlining: false, nameTableKind: None)
!564 = !DIFile(filename: "../src/sum.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!565 = !{!422}
!566 = !{!112}
!567 = !{!568, !607}
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "buffer_length", scope: !570, file: !564, line: 39, type: !562, isLocal: true, isDefinition: true)
!570 = distinct !DISubprogram(name: "bsd_sum_stream", scope: !564, file: !564, line: 33, type: !571, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !563, retainedNodes: !66)
!571 = !DISubroutineType(types: !572)
!572 = !{!90, !573, !85, !228}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !177, line: 7, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !179, line: 49, size: 1728, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !575, file: !179, line: 51, baseType: !90, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !575, file: !179, line: 54, baseType: !84, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !575, file: !179, line: 55, baseType: !84, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !575, file: !179, line: 56, baseType: !84, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !575, file: !179, line: 57, baseType: !84, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !575, file: !179, line: 58, baseType: !84, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !575, file: !179, line: 59, baseType: !84, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !575, file: !179, line: 60, baseType: !84, size: 64, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !575, file: !179, line: 61, baseType: !84, size: 64, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !575, file: !179, line: 64, baseType: !84, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !575, file: !179, line: 65, baseType: !84, size: 64, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !575, file: !179, line: 66, baseType: !84, size: 64, offset: 704)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !575, file: !179, line: 68, baseType: !194, size: 64, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !575, file: !179, line: 70, baseType: !591, size: 64, offset: 832)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !575, file: !179, line: 72, baseType: !90, size: 32, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !575, file: !179, line: 73, baseType: !90, size: 32, offset: 928)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !575, file: !179, line: 74, baseType: !201, size: 64, offset: 960)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !575, file: !179, line: 77, baseType: !91, size: 16, offset: 1024)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !575, file: !179, line: 78, baseType: !204, size: 8, offset: 1040)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !575, file: !179, line: 79, baseType: !206, size: 8, offset: 1048)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !575, file: !179, line: 81, baseType: !210, size: 64, offset: 1088)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !575, file: !179, line: 89, baseType: !213, size: 64, offset: 1152)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !575, file: !179, line: 91, baseType: !215, size: 64, offset: 1216)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !575, file: !179, line: 92, baseType: !218, size: 64, offset: 1280)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !575, file: !179, line: 93, baseType: !591, size: 64, offset: 1344)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !575, file: !179, line: 94, baseType: !85, size: 64, offset: 1408)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !575, file: !179, line: 95, baseType: !86, size: 64, offset: 1472)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !575, file: !179, line: 96, baseType: !90, size: 32, offset: 1536)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !575, file: !179, line: 98, baseType: !225, size: 160, offset: 1568)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "buffer_length", scope: !609, file: !564, line: 116, type: !562, isLocal: true, isDefinition: true)
!609 = distinct !DISubprogram(name: "sysv_sum_stream", scope: !564, file: !564, line: 111, type: !571, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !563, retainedNodes: !66)
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "../lib/md5-stream.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, splitDebugInlining: false, nameTableKind: None)
!613 = !DIFile(filename: "../lib/sha1-stream.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !616, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "../lib/sha256-stream.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!616 = !{!617, !621}
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !618, line: 33, baseType: !6, size: 32, elements: !619)
!618 = !DIFile(filename: "../lib/sha256.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!619 = !{!620}
!620 = !DIEnumerator(name: "SHA256_DIGEST_SIZE", value: 32, isUnsigned: true)
!621 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !618, line: 32, baseType: !6, size: 32, elements: !622)
!622 = !{!623}
!623 = !DIEnumerator(name: "SHA224_DIGEST_SIZE", value: 28, isUnsigned: true)
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !626, splitDebugInlining: false, nameTableKind: None)
!625 = !DIFile(filename: "../lib/sha512-stream.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!626 = !{!627, !631}
!627 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !628, line: 33, baseType: !6, size: 32, elements: !629)
!628 = !DIFile(filename: "../lib/sha512.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!629 = !{!630}
!630 = !DIEnumerator(name: "SHA512_DIGEST_SIZE", value: 64, isUnsigned: true)
!631 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !628, line: 32, baseType: !6, size: 32, elements: !632)
!632 = !{!633}
!633 = !DIEnumerator(name: "SHA384_DIGEST_SIZE", value: 48, isUnsigned: true)
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, splitDebugInlining: false, nameTableKind: None)
!635 = !DIFile(filename: "../lib/sm3-stream.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!636 = distinct !DICompileUnit(language: DW_LANG_C99, file: !637, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !638, splitDebugInlining: false, nameTableKind: None)
!637 = !DIFile(filename: "../lib/fadvise.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!638 = !{!69}
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, splitDebugInlining: false, nameTableKind: None)
!640 = !DIFile(filename: "../lib/fopen-safer.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !643, splitDebugInlining: false, nameTableKind: None)
!642 = !DIFile(filename: "../lib/umaxtostr.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!643 = !{!62}
!644 = distinct !DICompileUnit(language: DW_LANG_C99, file: !645, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, splitDebugInlining: false, nameTableKind: None)
!645 = !DIFile(filename: "../lib/dup-safer.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!646 = distinct !DICompileUnit(language: DW_LANG_C99, file: !647, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !648, retainedTypes: !652, splitDebugInlining: false, nameTableKind: None)
!647 = !DIFile(filename: "../lib/version-etc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!648 = !{!649}
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !647, line: 40, baseType: !6, size: 32, elements: !650)
!650 = !{!651}
!651 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2021, isUnsigned: true)
!652 = !{!79, !85}
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !655, retainedTypes: !670, splitDebugInlining: false, nameTableKind: None)
!654 = !DIFile(filename: "../lib/xmalloc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!655 = !{!656, !663}
!656 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !657, file: !654, line: 183, baseType: !6, size: 32, elements: !661)
!657 = distinct !DISubprogram(name: "x2nrealloc", scope: !654, file: !654, line: 171, type: !658, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !653, retainedNodes: !66)
!658 = !DISubroutineType(types: !659)
!659 = !{!85, !85, !660, !86}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!661 = !{!662}
!662 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!663 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !664, file: !654, line: 225, baseType: !6, size: 32, elements: !661)
!664 = distinct !DISubprogram(name: "xpalloc", scope: !654, file: !654, line: 218, type: !665, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !653, retainedNodes: !66)
!665 = !DISubroutineType(types: !666)
!666 = !{!85, !85, !667, !668, !163, !668}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !669, line: 125, baseType: !163)
!669 = !DIFile(filename: "../lib/idx.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!670 = !{!84, !85, !668, !204, !6, !89, !671, !91, !90, !164, !61, !672, !673}
!671 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!672 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!673 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "../lib/xalloc-die.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !678, splitDebugInlining: false, nameTableKind: None)
!677 = !DIFile(filename: "../lib/xdectoumax.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!678 = !{!33}
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !681, retainedTypes: !682, splitDebugInlining: false, nameTableKind: None)
!680 = !DIFile(filename: "../lib/xstrtoumax.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!681 = !{!33, !41}
!682 = !{!90, !91}
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "../lib/fclose.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!685 = distinct !DICompileUnit(language: DW_LANG_C99, file: !686, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !687, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "../lib/fflush.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!687 = !{!85}
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "../lib/free.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!690 = distinct !DICompileUnit(language: DW_LANG_C99, file: !691, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !687, splitDebugInlining: false, nameTableKind: None)
!691 = !DIFile(filename: "../lib/fseeko.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !693, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !694, splitDebugInlining: false, nameTableKind: None)
!693 = !DIFile(filename: "../lib/mbrtowc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!694 = !{!86}
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !697, splitDebugInlining: false, nameTableKind: None)
!696 = !DIFile(filename: "../lib/c-strcasecmp.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!697 = !{!255}
!698 = distinct !DICompileUnit(language: DW_LANG_C99, file: !699, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, splitDebugInlining: false, nameTableKind: None)
!699 = !DIFile(filename: "../lib/close-stream.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!700 = distinct !DICompileUnit(language: DW_LANG_C99, file: !701, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, splitDebugInlining: false, nameTableKind: None)
!701 = !DIFile(filename: "../lib/hard-locale.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !687, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "../lib/ialloc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !706, retainedTypes: !687, splitDebugInlining: false, nameTableKind: None)
!705 = !DIFile(filename: "../lib/localcharset.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!706 = !{!707}
!707 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !708, line: 41, baseType: !6, size: 32, elements: !709)
!708 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092}
!710 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!711 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!712 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!713 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!714 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!715 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!716 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!717 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!718 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!719 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!720 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!721 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!722 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!723 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!724 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!725 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!726 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!727 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!728 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!729 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!730 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!731 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!732 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!733 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!734 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!735 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!736 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!737 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!738 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!739 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!740 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!741 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!742 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!743 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!744 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!745 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!746 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!747 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!748 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!749 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!750 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!751 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!752 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!753 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!754 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!755 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!756 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!757 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!758 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!759 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!818 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!821 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!822 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!823 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!824 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!825 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!826 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!827 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!828 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!829 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!830 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!831 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!832 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!905 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!978 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!979 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!980 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!981 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!982 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!983 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!984 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!985 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!986 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!987 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!988 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!989 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!990 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!991 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!992 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!994 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!995 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!996 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!997 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!998 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!999 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!1024 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!1025 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!1026 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
