; ModuleID = 'ls.bc.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pending = type { i8*, i8*, i8, %struct.pending* }
%struct.dev_ino = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.fileinfo = type { i8*, i8*, i8*, %struct.stat, i32, i32, i8*, i8, i8, i32, i8, i32, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.bin_str = type { i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque

!581 = distinct !DISubprogram(name: "get_funky_string", scope: !3, file: !3, line: 2494, type: !582, scopeLine: 2496, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !95)
!582 = !DISubroutineType(types: !583)
!583 = !{!94, !584, !587, !94, !590}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !592, line: 46, baseType: !593)
!592 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!593 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!594 = !{!595, !596, !597, !598, !599, !600, !601}
!595 = !DIEnumerator(name: "ST_GND", value: 0, isUnsigned: true)
!596 = !DIEnumerator(name: "ST_BACKSLASH", value: 1, isUnsigned: true)
!597 = !DIEnumerator(name: "ST_OCTAL", value: 2, isUnsigned: true)
!598 = !DIEnumerator(name: "ST_HEX", value: 3, isUnsigned: true)
!599 = !DIEnumerator(name: "ST_CARET", value: 4, isUnsigned: true)
!600 = !DIEnumerator(name: "ST_END", value: 5, isUnsigned: true)
!601 = !DIEnumerator(name: "ST_ERROR", value: 6, isUnsigned: true)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !603, line: 28, baseType: !6, size: 32, elements: !604)
!603 = !DIFile(filename: "../lib/canonicalize.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!604 = !{!605, !606, !607, !608}
!605 = !DIEnumerator(name: "CAN_EXISTING", value: 0, isUnsigned: true)
!606 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1, isUnsigned: true)
!607 = !DIEnumerator(name: "CAN_MISSING", value: 2, isUnsigned: true)
!608 = !DIEnumerator(name: "CAN_NOLINKS", value: 4, isUnsigned: true)
!609 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 761, baseType: !6, size: 32, elements: !610)
!610 = !{!611}
!611 = !DIEnumerator(name: "TIME_STAMP_LEN_MAXIMUM", value: 1000, isUnsigned: true)
!612 = !{!613, !618, !588, !619, !591, !622, !585, !628, !627, !630, !631, !634}
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !614, line: 7, baseType: !615)
!614 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !616, line: 160, baseType: !617)
!616 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!617 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !620, line: 102, baseType: !621)
!620 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !616, line: 73, baseType: !593)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !623, line: 72, baseType: !624)
!623 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !627}
!627 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!630 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !632, line: 85, baseType: !633)
!632 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !616, line: 152, baseType: !617)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!635 = !{!636, !642, !696, !698, !700, !702, !704, !713, !715, !717, !719, !721, !723, !725, !727, !729, !731, !733, !735, !737, !739, !741, !745, !747, !749, !755, !757, !759, !765, !0, !767, !818, !820, !822, !827, !829, !831, !840, !846, !858, !866, !880, !882, !884, !886, !888, !890, !892, !894, !896, !898, !900, !902, !909, !915, !921, !927, !929, !931, !937, !940, !944, !949, !953, !955, !961, !966, !968, !970, !972, !974, !976, !978, !983, !985, !989, !994, !996, !1002, !1004, !1012, !1017, !1022, !1024, !1027, !1030, !1032, !1034, !1036, !1038, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1058, !1063, !1068, !1070, !1085, !1095, !1105, !1110, !1118, !1123}
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "active_dir_set", scope: !2, file: !3, line: 324, type: !638, isLocal: true, isDefinition: true)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !640, line: 50, baseType: !641)
!640 = !DIFile(filename: "../lib/hash.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !640, line: 48, flags: DIFlagFwdDecl)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "cwd_file", scope: !2, file: !3, line: 335, type: !644, isLocal: true, isDefinition: true)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !3, line: 197, size: 1664, elements: !646)
!646 = !{!647, !648, !649, !650, !686, !687, !689, !690, !691, !692, !693, !694, !695}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !645, file: !3, line: 200, baseType: !585, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !645, file: !3, line: 203, baseType: !585, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_name", scope: !645, file: !3, line: 206, baseType: !585, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !645, file: !3, line: 208, baseType: !651, size: 1152, offset: 192)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !652, line: 46, size: 1152, elements: !653)
!652 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!653 = !{!654, !656, !658, !660, !662, !664, !666, !667, !668, !669, !671, !673, !680, !681, !682}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !651, file: !652, line: 48, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !616, line: 145, baseType: !593)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !651, file: !652, line: 53, baseType: !657, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !616, line: 148, baseType: !593)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !651, file: !652, line: 61, baseType: !659, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !616, line: 151, baseType: !593)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !651, file: !652, line: 62, baseType: !661, size: 32, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !616, line: 150, baseType: !6)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !651, file: !652, line: 64, baseType: !663, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !616, line: 146, baseType: !6)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !651, file: !652, line: 65, baseType: !665, size: 32, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !616, line: 147, baseType: !6)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !651, file: !652, line: 67, baseType: !627, size: 32, offset: 288)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !651, file: !652, line: 69, baseType: !655, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !651, file: !652, line: 74, baseType: !633, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !651, file: !652, line: 78, baseType: !670, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !616, line: 174, baseType: !617)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !651, file: !652, line: 80, baseType: !672, size: 64, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !616, line: 179, baseType: !617)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !651, file: !652, line: 91, baseType: !674, size: 128, offset: 576)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !675, line: 10, size: 128, elements: !676)
!675 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !674, file: !675, line: 12, baseType: !615, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !674, file: !675, line: 16, baseType: !679, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !616, line: 196, baseType: !617)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !651, file: !652, line: 92, baseType: !674, size: 128, offset: 704)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !651, file: !652, line: 93, baseType: !674, size: 128, offset: 832)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !651, file: !652, line: 106, baseType: !683, size: 192, offset: 960)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 192, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 3)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !645, file: !3, line: 210, baseType: !69, size: 32, offset: 1344)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "linkmode", scope: !645, file: !3, line: 214, baseType: !688, size: 32, offset: 1376)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !632, line: 69, baseType: !661)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "scontext", scope: !645, file: !3, line: 217, baseType: !585, size: 64, offset: 1408)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "stat_ok", scope: !645, file: !3, line: 219, baseType: !94, size: 8, offset: 1472)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "linkok", scope: !645, file: !3, line: 223, baseType: !94, size: 8, offset: 1480)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "acl_type", scope: !645, file: !3, line: 227, baseType: !85, size: 32, offset: 1504)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "has_capability", scope: !645, file: !3, line: 230, baseType: !94, size: 8, offset: 1536)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "quoted", scope: !645, file: !3, line: 233, baseType: !627, size: 32, offset: 1568)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !645, file: !3, line: 236, baseType: !591, size: 64, offset: 1600)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "cwd_n_alloc", scope: !2, file: !3, line: 338, type: !591, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "cwd_n_used", scope: !2, file: !3, line: 341, type: !591, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "color_symlink_as_referent", scope: !2, file: !3, line: 360, type: !94, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "hostname", scope: !2, file: !3, line: 362, type: !588, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "pending_dirs", scope: !2, file: !3, line: 386, type: !706, isLocal: true, isDefinition: true)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pending", file: !3, line: 375, size: 256, elements: !708)
!708 = !{!709, !710, !711, !712}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !707, file: !3, line: 377, baseType: !585, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !707, file: !3, line: 381, baseType: !585, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "command_line_arg", scope: !707, file: !3, line: 382, baseType: !94, size: 8, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !707, file: !3, line: 383, baseType: !706, size: 64, offset: 192)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "current_time", scope: !2, file: !3, line: 391, type: !674, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "print_scontext", scope: !2, file: !3, line: 393, type: !94, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "format", scope: !2, file: !3, line: 436, type: !36, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "sort_type", scope: !2, file: !3, line: 491, type: !59, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "print_block_size", scope: !2, file: !3, line: 520, type: !94, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "dired", scope: !2, file: !3, line: 535, type: !94, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "indicator_style", scope: !2, file: !3, line: 552, type: !50, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "print_with_color", scope: !2, file: !3, line: 569, type: !94, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "print_hyperlink", scope: !2, file: !3, line: 571, type: !94, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "check_symlink_mode", scope: !2, file: !3, line: 655, type: !94, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "dereference", scope: !2, file: !3, line: 664, type: !43, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "recursive", scope: !2, file: !3, line: 669, type: !94, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "immediate_dirs", scope: !2, file: !3, line: 674, type: !94, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "directories_first", scope: !2, file: !3, line: 678, type: !94, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "filename_quoting_options", scope: !2, file: !3, line: 725, type: !743, isLocal: true, isDefinition: true)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !104, line: 270, flags: DIFlagFwdDecl)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "tabsize", scope: !2, file: !3, line: 730, type: !591, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "print_dir_name", scope: !2, file: !3, line: 734, type: !94, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 743, type: !751, isLocal: true, isDefinition: true)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !752, line: 856, baseType: !753)
!752 = !DIFile(filename: "./lib/time.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !752, line: 856, flags: DIFlagFwdDecl)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "format_needs_stat", scope: !2, file: !3, line: 748, type: !94, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "format_needs_type", scope: !2, file: !3, line: 753, type: !94, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !2, file: !3, line: 802, type: !761, isLocal: true, isDefinition: true)
!761 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !763, line: 8, baseType: !764)
!763 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sig_atomic_t.h", directory: "")
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !616, line: 214, baseType: !627)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "stop_signal_count", scope: !2, file: !3, line: 806, type: !761, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "dired_obstack", scope: !2, file: !3, line: 1008, type: !769, isLocal: true, isDefinition: true)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !770, line: 173, size: 704, elements: !771)
!770 = !DIFile(filename: "../lib/obstack.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!771 = !{!772, !773, !783, !784, !785, !786, !791, !792, !803, !814, !815, !816, !817}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !769, file: !770, line: 175, baseType: !591, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !769, file: !770, line: 176, baseType: !774, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !770, line: 166, size: 128, elements: !776)
!776 = !{!777, !778, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !775, file: !770, line: 168, baseType: !585, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !775, file: !770, line: 169, baseType: !774, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !775, file: !770, line: 170, baseType: !780, offset: 128)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: -1)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !769, file: !770, line: 177, baseType: !585, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !769, file: !770, line: 178, baseType: !585, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !769, file: !770, line: 179, baseType: !585, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !769, file: !770, line: 184, baseType: !787, size: 64, offset: 320)
!787 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !769, file: !770, line: 180, size: 64, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !787, file: !770, line: 182, baseType: !591, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !787, file: !770, line: 183, baseType: !618, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !769, file: !770, line: 185, baseType: !591, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !769, file: !770, line: 192, baseType: !793, size: 64, offset: 448)
!793 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !769, file: !770, line: 188, size: 64, elements: !794)
!794 = !{!795, !799}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !793, file: !770, line: 190, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!618, !591}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !793, file: !770, line: 191, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!618, !618, !591}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !769, file: !770, line: 197, baseType: !804, size: 64, offset: 512)
!804 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !769, file: !770, line: 193, size: 64, elements: !805)
!805 = !{!806, !810}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !804, file: !770, line: 195, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !618}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !804, file: !770, line: 196, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !618, !618}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !769, file: !770, line: 199, baseType: !618, size: 64, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !769, file: !770, line: 200, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !769, file: !770, line: 201, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !769, file: !770, line: 205, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "subdired_obstack", scope: !2, file: !3, line: 1015, type: !769, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "dev_ino_obstack", scope: !2, file: !3, line: 1028, type: !769, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "RFC3986", scope: !2, file: !3, line: 1275, type: !824, isLocal: true, isDefinition: true)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 2048, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 256)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "dired_pos", scope: !2, file: !3, line: 976, type: !631, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "used_color", scope: !2, file: !3, line: 577, type: !94, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "color_indicator", scope: !2, file: !3, line: 618, type: !833, isLocal: true, isDefinition: true)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 3072, elements: !838)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_str", file: !3, line: 245, size: 128, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !834, file: !3, line: 247, baseType: !591, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !834, file: !3, line: 248, baseType: !588, size: 64, offset: 64)
!838 = !{!839}
!839 = !DISubrange(count: 24)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "sig", scope: !91, file: !3, line: 1550, type: !842, isLocal: true, isDefinition: true)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 384, elements: !844)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!844 = !{!845}
!845 = !DISubrange(count: 12)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 798, type: !848, isLocal: true, isDefinition: true)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !849, line: 7, baseType: !850)
!849 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sigset_t.h", directory: "")
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !851, line: 8, baseType: !852)
!851 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !851, line: 5, size: 1024, elements: !853)
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !852, file: !851, line: 7, baseType: !855, size: 1024)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 1024, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 16)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "posix_prefix", scope: !860, file: !3, line: 2394, type: !863, isLocal: true, isDefinition: true)
!860 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 1900, type: !861, scopeLine: 1901, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !95)
!861 = !DISubroutineType(types: !862)
!862 = !{!627, !627, !584}
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 56, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 7)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 850, type: !868, isLocal: true, isDefinition: true)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !869, size: 11520, elements: !878)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !871, line: 50, size: 256, elements: !872)
!871 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!872 = !{!873, !874, !875, !877}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !870, file: !871, line: 52, baseType: !588, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !870, file: !871, line: 55, baseType: !627, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !870, file: !871, line: 56, baseType: !876, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !870, file: !871, line: 57, baseType: !627, size: 32, offset: 192)
!878 = !{!879}
!879 = !DISubrange(count: 45)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "ignore_mode", scope: !2, file: !3, line: 693, type: !98, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "time_type", scope: !2, file: !3, line: 473, type: !117, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "print_owner", scope: !2, file: !3, line: 503, type: !94, isLocal: true, isDefinition: true)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 523, type: !627, isLocal: true, isDefinition: true)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "file_human_output_opts", scope: !2, file: !3, line: 529, type: !627, isLocal: true, isDefinition: true)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 526, type: !619, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "file_output_block_size", scope: !2, file: !3, line: 530, type: !619, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "print_inode", scope: !2, file: !3, line: 659, type: !94, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "numeric_ids", scope: !2, file: !3, line: 516, type: !94, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "print_group", scope: !2, file: !3, line: 511, type: !94, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "sort_reverse", scope: !2, file: !3, line: 499, type: !94, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "ignore_patterns", scope: !2, file: !3, line: 706, type: !904, isLocal: true, isDefinition: true)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ignore_pattern", file: !3, line: 700, size: 128, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !905, file: !3, line: 702, baseType: !588, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !905, file: !3, line: 703, baseType: !904, size: 64, offset: 64)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "when_types", scope: !2, file: !3, line: 945, type: !911, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 288, elements: !913)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!913 = !{!914}
!914 = !DISubrange(count: 9)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "when_args", scope: !2, file: !3, line: 938, type: !917, isLocal: true, isDefinition: true)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 640, elements: !919)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!919 = !{!920}
!920 = !DISubrange(count: 10)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "out_tty", scope: !923, file: !3, line: 1889, type: !926, isLocal: true, isDefinition: true)
!923 = distinct !DISubprogram(name: "stdout_isatty", scope: !3, file: !3, line: 1887, type: !924, scopeLine: 1888, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !95)
!924 = !DISubroutineType(types: !925)
!925 = !{!94}
!926 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "print_author", scope: !2, file: !3, line: 507, type: !94, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "hide_patterns", scope: !2, file: !3, line: 710, type: !904, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "sort_types", scope: !2, file: !3, line: 917, type: !933, isLocal: true, isDefinition: true)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 192, elements: !935)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!935 = !{!936}
!936 = !DISubrange(count: 6)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "sort_args", scope: !2, file: !3, line: 913, type: !939, isLocal: true, isDefinition: true)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 448, elements: !864)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "time_types", scope: !2, file: !3, line: 930, type: !942, isLocal: true, isDefinition: true)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 224, elements: !864)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 923, type: !946, isLocal: true, isDefinition: true)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 512, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 8)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "format_types", scope: !2, file: !3, line: 906, type: !951, isLocal: true, isDefinition: true)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 224, elements: !864)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "format_args", scope: !2, file: !3, line: 901, type: !946, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "indicator_style_types", scope: !2, file: !3, line: 559, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 128, elements: !959)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!959 = !{!960}
!960 = !DISubrange(count: 4)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(name: "indicator_style_args", scope: !2, file: !3, line: 555, type: !963, isLocal: true, isDefinition: true)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 320, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 5)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "eolbyte", scope: !2, file: !3, line: 1070, type: !586, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "line_length", scope: !2, file: !3, line: 739, type: !591, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "max_idx", scope: !2, file: !3, line: 965, type: !591, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "qmark_funny_chars", scope: !2, file: !3, line: 721, type: !94, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "align_variable_outer_quotes", scope: !2, file: !3, line: 348, type: !94, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "dirname_quoting_options", scope: !2, file: !3, line: 726, type: !743, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "long_time_format", scope: !2, file: !3, line: 766, type: !980, isLocal: true, isDefinition: true)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 128, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: 2)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(name: "time_style_args", scope: !2, file: !3, line: 449, type: !963, isLocal: true, isDefinition: true)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "time_style_types", scope: !2, file: !3, line: 453, type: !987, isLocal: true, isDefinition: true)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 128, elements: !959)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(name: "abformat", scope: !2, file: !3, line: 1299, type: !991, isLocal: true, isDefinition: true)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 24576, elements: !992)
!992 = !{!982, !845, !993}
!993 = !DISubrange(count: 128)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(name: "use_abformat", scope: !2, file: !3, line: 1303, type: !94, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "G_line", scope: !2, file: !998, line: 1, type: !999, isLocal: true, isDefinition: true)
!998 = !DIFile(filename: "../src/dircolors.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 34544, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 4318)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "color_buf", scope: !2, file: !3, line: 650, type: !585, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "color_ext_list", scope: !2, file: !3, line: 647, type: !1006, isLocal: true, isDefinition: true)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "color_ext_type", file: !3, line: 611, size: 320, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1007, file: !3, line: 613, baseType: !834, size: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1007, file: !3, line: 614, baseType: !834, size: 128, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1007, file: !3, line: 615, baseType: !1006, size: 64, offset: 256)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "indicator_name", scope: !2, file: !3, line: 604, type: !1014, isLocal: true, isDefinition: true)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 1600, elements: !1015)
!1015 = !{!1016}
!1016 = !DISubrange(count: 25)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "first", scope: !1019, file: !3, line: 2940, type: !94, isLocal: true, isDefinition: true)
!1019 = distinct !DISubprogram(name: "print_dir", scope: !3, file: !3, line: 2935, type: !1020, scopeLine: 2936, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !95)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{null, !588, !588, !94}
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(name: "cwd_some_quoted", scope: !2, file: !3, line: 344, type: !94, isLocal: true, isDefinition: true)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(name: "sorted_file", scope: !2, file: !3, line: 352, type: !1026, isLocal: true, isDefinition: true)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "UNKNOWN_SECURITY_CONTEXT", scope: !2, file: !3, line: 394, type: !1029, isLocal: true, isDefinition: true)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 16, elements: !981)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "any_has_acl", scope: !2, file: !3, line: 399, type: !94, isLocal: true, isDefinition: true)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(name: "inode_number_width", scope: !2, file: !3, line: 405, type: !627, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "block_size_width", scope: !2, file: !3, line: 406, type: !627, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "nlink_width", scope: !2, file: !3, line: 407, type: !627, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "owner_width", scope: !2, file: !3, line: 409, type: !627, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "group_width", scope: !2, file: !3, line: 410, type: !627, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "author_width", scope: !2, file: !3, line: 411, type: !627, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "scontext_width", scope: !2, file: !3, line: 408, type: !627, isLocal: true, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(name: "major_device_number_width", scope: !2, file: !3, line: 412, type: !627, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "minor_device_number_width", scope: !2, file: !3, line: 413, type: !627, isLocal: true, isDefinition: true)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(name: "file_size_width", scope: !2, file: !3, line: 414, type: !627, isLocal: true, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !1054, file: !3, line: 3297, type: !1057, isLocal: true, isDefinition: true)
!1054 = distinct !DISubprogram(name: "has_capability_cache", scope: !3, file: !3, line: 3293, type: !1055, scopeLine: 3294, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !95)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!94, !588, !644}
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !632, line: 59, baseType: !655)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !1060, file: !3, line: 3242, type: !1057, isLocal: true, isDefinition: true)
!1060 = distinct !DISubprogram(name: "getfilecon_cache", scope: !3, file: !3, line: 3238, type: !1061, scopeLine: 3239, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !95)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!627, !588, !644, !94}
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(name: "unsupported_device", scope: !1065, file: !3, line: 3272, type: !1057, isLocal: true, isDefinition: true)
!1065 = distinct !DISubprogram(name: "file_has_acl_cache", scope: !3, file: !3, line: 3268, type: !1066, scopeLine: 3269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !95)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!627, !588, !644}
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(name: "sorted_file_alloc", scope: !2, file: !3, line: 353, type: !591, isLocal: true, isDefinition: true)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "failed_strcoll", scope: !2, file: !3, line: 3780, type: !1072, isLocal: true, isDefinition: true)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !1073, line: 45, baseType: !1074)
!1073 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 1600, elements: !1083)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !1073, line: 33, size: 1600, elements: !1076)
!1076 = !{!1077, !1081, !1082}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !1075, file: !1073, line: 39, baseType: !1078, size: 512)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !1079, line: 31, baseType: !1080)
!1079 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 512, elements: !947)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !1075, file: !1073, line: 40, baseType: !627, size: 32, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !1075, file: !1073, line: 41, baseType: !850, size: 1024, offset: 576)
!1083 = !{!1084}
!1084 = !DISubrange(count: 1)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(name: "sort_functions", scope: !2, file: !3, line: 3999, type: !1087, isLocal: true, isDefinition: true)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1088, size: 4608, elements: !1094)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1089)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "qsortFunc", file: !3, line: 3801, baseType: !1090)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!627, !1093, !1093}
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "V", file: !3, line: 3800, baseType: !628)
!1094 = !{!914, !982, !982, !982}
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(name: "filetype_indicator", scope: !1097, file: !3, line: 4974, type: !1104, isLocal: true, isDefinition: true)
!1097 = distinct !DISubprogram(name: "get_color_indicator", scope: !3, file: !3, line: 4946, type: !1098, scopeLine: 4947, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !95)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!1100, !1102, !94}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !834)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 320, elements: !919)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(name: "column_info_alloc", scope: !1107, file: !3, line: 5278, type: !591, isLocal: true, isDefinition: true)
!1107 = distinct !DISubprogram(name: "init_column_info", scope: !3, file: !3, line: 5273, type: !1108, scopeLine: 5274, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !95)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{null, !591}
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(name: "column_info", scope: !2, file: !3, line: 962, type: !1112, isLocal: true, isDefinition: true)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "column_info", file: !3, line: 954, size: 192, elements: !1114)
!1114 = !{!1115, !1116, !1117}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "valid_len", scope: !1113, file: !3, line: 956, baseType: !94, size: 8)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "line_len", scope: !1113, file: !3, line: 957, baseType: !591, size: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "col_arr", scope: !1113, file: !3, line: 958, baseType: !590, size: 64, offset: 128)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(name: "filetype_letter", scope: !2, file: !3, line: 178, type: !1120, isLocal: true, isDefinition: true)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 88, elements: !1121)
!1121 = !{!1122}
!1122 = !DISubrange(count: 11)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(name: "width", scope: !1125, file: !3, line: 4176, type: !627, isLocal: true, isDefinition: true)
!1125 = distinct !DISubprogram(name: "long_time_expected_width", scope: !3, file: !3, line: 4174, type: !1126, scopeLine: 4175, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !95)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!627}
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(name: "ls_mode", scope: !1130, file: !1131, line: 2, type: !627, isLocal: false, isDefinition: true)
!1130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1131, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, globals: !1132, splitDebugInlining: false, nameTableKind: None)
!1131 = !DIFile(filename: "../src/ls-ls.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1132 = !{!1128}
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(name: "Version", scope: !1135, file: !1136, line: 2, type: !588, isLocal: false, isDefinition: true)
!1135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1136, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, globals: !1137, splitDebugInlining: false, nameTableKind: None)
!1136 = !DIFile(filename: "src/version.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1137 = !{!1133}
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1140, file: !1141, line: 67, type: !1145, isLocal: false, isDefinition: true)
!1140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1141, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1142, retainedTypes: !1143, globals: !1144, splitDebugInlining: false, nameTableKind: None)
!1141 = !DIFile(filename: "../lib/argmatch.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1142 = !{!103}
!1143 = !{!618, !588}
!1144 = !{!1138}
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1146, line: 61, baseType: !1147)
!1146 = !DIFile(filename: "../lib/argmatch.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{null}
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(name: "dir_suffix", scope: !1152, file: !1153, line: 106, type: !1157, isLocal: true, isDefinition: true)
!1152 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1153, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1154, retainedTypes: !1155, globals: !1156, splitDebugInlining: false, nameTableKind: None)
!1153 = !DIFile(filename: "../lib/canonicalize.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1154 = !{!602}
!1155 = !{!618}
!1156 = !{!1150}
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 16, elements: !981)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(name: "file_name", scope: !1160, file: !1161, line: 46, type: !588, isLocal: true, isDefinition: true)
!1160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1161, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1162, globals: !1163, splitDebugInlining: false, nameTableKind: None)
!1161 = !DIFile(filename: "../lib/closeout.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1162 = !{!588}
!1163 = !{!1158, !1164}
!1164 = !DIGlobalVariableExpression(var: !1165, expr: !DIExpression())
!1165 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1160, file: !1161, line: 56, type: !94, isLocal: true, isDefinition: true)
!1166 = !DIGlobalVariableExpression(var: !1167, expr: !DIExpression())
!1167 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1168, file: !1169, line: 24, type: !1171, isLocal: false, isDefinition: true)
!1168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1169, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, globals: !1170, splitDebugInlining: false, nameTableKind: None)
!1169 = !DIFile(filename: "../lib/exitfail.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1170 = !{!1166}
!1171 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !627)
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(name: "default_tuning", scope: !1174, file: !1175, line: 130, type: !1179, isLocal: true, isDefinition: true)
!1174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1175, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1176, globals: !1178, splitDebugInlining: false, nameTableKind: None)
!1175 = !DIFile(filename: "../lib/hash.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1176 = !{!593, !618, !1177, !591}
!1177 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1178 = !{!1172}
!1179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !640, line: 46, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !640, line: 34, size: 160, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1186, !1187}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !1181, file: !640, line: 39, baseType: !1177, size: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !1181, file: !640, line: 40, baseType: !1177, size: 32, offset: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !1181, file: !640, line: 41, baseType: !1177, size: 32, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !1181, file: !640, line: 42, baseType: !1177, size: 32, offset: 96)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !1181, file: !640, line: 43, baseType: !94, size: 8, offset: 128)
!1188 = !DIGlobalVariableExpression(var: !1189, expr: !DIExpression())
!1189 = distinct !DIGlobalVariable(name: "power_letter", scope: !1190, file: !1191, line: 36, type: !1201, isLocal: true, isDefinition: true)
!1190 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1191, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1192, retainedTypes: !1193, globals: !1194, splitDebugInlining: false, nameTableKind: None)
!1191 = !DIFile(filename: "../lib/human.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1192 = !{!124, !142}
!1193 = !{!628}
!1194 = !{!1188, !1195, !1198}
!1195 = !DIGlobalVariableExpression(var: !1196, expr: !DIExpression())
!1196 = distinct !DIGlobalVariable(name: "block_size_args", scope: !1190, file: !1191, line: 398, type: !1197, isLocal: true, isDefinition: true)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 192, elements: !684)
!1198 = !DIGlobalVariableExpression(var: !1199, expr: !DIExpression())
!1199 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !1190, file: !1191, line: 399, type: !1200, isLocal: true, isDefinition: true)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 64, elements: !981)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 72, elements: !913)
!1202 = !DIGlobalVariableExpression(var: !1203, expr: !DIExpression())
!1203 = distinct !DIGlobalVariable(name: "user_alist", scope: !1204, file: !1205, line: 55, type: !1209, isLocal: true, isDefinition: true)
!1204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1205, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1155, globals: !1206, splitDebugInlining: false, nameTableKind: None)
!1205 = !DIFile(filename: "../lib/idcache.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1206 = !{!1202, !1207, !1221, !1223}
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(name: "nouser_alist", scope: !1204, file: !1205, line: 58, type: !1209, isLocal: true, isDefinition: true)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "userid", file: !1205, line: 37, size: 128, elements: !1211)
!1211 = !{!1212, !1219, !1220}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1210, file: !1205, line: 43, baseType: !1213, size: 32)
!1213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1210, file: !1205, line: 39, size: 32, elements: !1214)
!1214 = !{!1215, !1217}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1213, file: !1205, line: 41, baseType: !1216, size: 32)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !632, line: 79, baseType: !663)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1213, file: !1205, line: 42, baseType: !1218, size: 32)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !632, line: 64, baseType: !665)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1210, file: !1205, line: 44, baseType: !1209, size: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1210, file: !1205, line: 45, baseType: !780, offset: 128)
!1221 = !DIGlobalVariableExpression(var: !1222, expr: !DIExpression())
!1222 = distinct !DIGlobalVariable(name: "group_alist", scope: !1204, file: !1205, line: 61, type: !1209, isLocal: true, isDefinition: true)
!1223 = !DIGlobalVariableExpression(var: !1224, expr: !DIExpression())
!1224 = distinct !DIGlobalVariable(name: "nogroup_alist", scope: !1204, file: !1205, line: 64, type: !1209, isLocal: true, isDefinition: true)
!1225 = !DIGlobalVariableExpression(var: !1226, expr: !DIExpression())
!1226 = distinct !DIGlobalVariable(name: "program_name", scope: !1227, file: !1228, line: 33, type: !588, isLocal: false, isDefinition: true)
!1227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1228, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1229, globals: !1230, splitDebugInlining: false, nameTableKind: None)
!1228 = !DIFile(filename: "../lib/progname.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1229 = !{!618, !585}
!1230 = !{!1225}
!1231 = !DIGlobalVariableExpression(var: !1232, expr: !DIExpression())
!1232 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1233, file: !1234, line: 78, type: !1272, isLocal: false, isDefinition: true)
!1233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1234, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1235, retainedTypes: !1241, globals: !1242, splitDebugInlining: false, nameTableKind: None)
!1234 = !DIFile(filename: "../lib/quotearg.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1235 = !{!103, !1236, !557}
!1236 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !104, line: 242, baseType: !6, size: 32, elements: !1237)
!1237 = !{!1238, !1239, !1240}
!1238 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!1239 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!1240 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!1241 = !{!627, !630, !591, !588}
!1242 = !{!1231, !1243, !1247, !1257, !1259, !1261, !1268, !1270}
!1243 = !DIGlobalVariableExpression(var: !1244, expr: !DIExpression())
!1244 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1233, file: !1234, line: 94, type: !1245, isLocal: false, isDefinition: true)
!1245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1246, size: 320, elements: !919)
!1246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!1247 = !DIGlobalVariableExpression(var: !1248, expr: !DIExpression())
!1248 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1233, file: !1234, line: 1044, type: !1249, isLocal: false, isDefinition: true)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1234, line: 58, size: 448, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1255, !1256}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1249, file: !1234, line: 61, baseType: !103, size: 32)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1249, file: !1234, line: 64, baseType: !627, size: 32, offset: 32)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1249, file: !1234, line: 68, baseType: !1254, size: 256, offset: 64)
!1254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !947)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1249, file: !1234, line: 71, baseType: !588, size: 64, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1249, file: !1234, line: 74, baseType: !588, size: 64, offset: 384)
!1257 = !DIGlobalVariableExpression(var: !1258, expr: !DIExpression())
!1258 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1233, file: !1234, line: 109, type: !1249, isLocal: true, isDefinition: true)
!1259 = !DIGlobalVariableExpression(var: !1260, expr: !DIExpression())
!1260 = distinct !DIGlobalVariable(name: "slot0", scope: !1233, file: !1234, line: 834, type: !824, isLocal: true, isDefinition: true)
!1261 = !DIGlobalVariableExpression(var: !1262, expr: !DIExpression())
!1262 = distinct !DIGlobalVariable(name: "slotvec", scope: !1233, file: !1234, line: 837, type: !1263, isLocal: true, isDefinition: true)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1234, line: 826, size: 128, elements: !1265)
!1265 = !{!1266, !1267}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1264, file: !1234, line: 828, baseType: !591, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1264, file: !1234, line: 829, baseType: !585, size: 64, offset: 64)
!1268 = !DIGlobalVariableExpression(var: !1269, expr: !DIExpression())
!1269 = distinct !DIGlobalVariable(name: "nslots", scope: !1233, file: !1234, line: 835, type: !627, isLocal: true, isDefinition: true)
!1270 = !DIGlobalVariableExpression(var: !1271, expr: !DIExpression())
!1271 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1233, file: !1234, line: 836, type: !1264, isLocal: true, isDefinition: true)
!1272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 704, elements: !1121)
!1273 = !DIGlobalVariableExpression(var: !1274, expr: !DIExpression())
!1274 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1275, file: !1276, line: 26, type: !1278, isLocal: false, isDefinition: true)
!1275 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1276, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, globals: !1277, splitDebugInlining: false, nameTableKind: None)
!1276 = !DIFile(filename: "../lib/version-etc-fsf.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1277 = !{!1273}
!1278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 376, elements: !1279)
!1279 = !{!1280}
!1280 = !DISubrange(count: 47)
!1281 = !DIGlobalVariableExpression(var: !1282, expr: !DIExpression())
!1282 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !1283, file: !1284, line: 350, type: !1147, isLocal: false, isDefinition: true)
!1283 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1284, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1285, globals: !1286, splitDebugInlining: false, nameTableKind: None)
!1284 = !DIFile(filename: "../lib/obstack.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1285 = !{!585, !618, !588}
!1286 = !{!1281}
!1287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1288, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1289, retainedTypes: !1155, splitDebugInlining: false, nameTableKind: None)
!1288 = !DIFile(filename: "../lib/areadlink-with-size.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1289 = !{!1290}
!1290 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1291, file: !1288, line: 64, baseType: !6, size: 32, elements: !1294)
!1291 = distinct !DISubprogram(name: "areadlink_with_size", scope: !1288, file: !1288, line: 53, type: !1292, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1287, retainedNodes: !95)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!585, !588, !591}
!1294 = !{!1295}
!1295 = !DIEnumerator(name: "stackbuf_size", value: 128, isUnsigned: true)
!1296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1297, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1298, splitDebugInlining: false, nameTableKind: None)
!1297 = !DIFile(filename: "../lib/basename-lgpl.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1298 = !{!585}
!1299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1300, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1300 = !DIFile(filename: "../lib/c-ctype.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1302, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1303, splitDebugInlining: false, nameTableKind: None)
!1302 = !DIFile(filename: "../lib/c-strncasecmp.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1303 = !{!1304}
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1306)
!1306 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1308, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1308 = !DIFile(filename: "../lib/dirname-lgpl.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1310, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1310 = !DIFile(filename: "../lib/file-has-acl.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1312, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1229, splitDebugInlining: false, nameTableKind: None)
!1312 = !DIFile(filename: "../lib/file-set.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1314, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1314 = !DIFile(filename: "../lib/filemode.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1315 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1316, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1155, splitDebugInlining: false, nameTableKind: None)
!1316 = !DIFile(filename: "../lib/filenamecat.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1318, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1155, splitDebugInlining: false, nameTableKind: None)
!1318 = !DIFile(filename: "../lib/filenamecat-lgpl.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1320, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1127, splitDebugInlining: false, nameTableKind: None)
!1320 = !DIFile(filename: "../lib/filevercmp.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1322, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1322 = !DIFile(filename: "../lib/gettime.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1323 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1324, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1324 = !DIFile(filename: "../lib/hard-locale.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1326, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1326 = !DIFile(filename: "../lib/hash-triple-simple.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1328, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1329, splitDebugInlining: false, nameTableKind: None)
!1328 = !DIFile(filename: "../lib/imaxtostr.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1329 = !{!1330}
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !620, line: 101, baseType: !1331)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !616, line: 72, baseType: !617)
!1332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1333, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1334, splitDebugInlining: false, nameTableKind: None)
!1333 = !DIFile(filename: "../lib/umaxtostr.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1334 = !{!619}
!1335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1336, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1337, retainedTypes: !1344, splitDebugInlining: false, nameTableKind: None)
!1336 = !DIFile(filename: "../lib/mbsalign.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1337 = !{!551, !1338}
!1338 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !552, line: 21, baseType: !6, size: 32, elements: !1339)
!1339 = !{!1340, !1341, !1342, !1343}
!1340 = !DIEnumerator(name: "MBA_UNIBYTE_FALLBACK", value: 1, isUnsigned: true)
!1341 = !DIEnumerator(name: "MBA_UNIBYTE_ONLY", value: 2, isUnsigned: true)
!1342 = !DIEnumerator(name: "MBA_NO_LEFT_PAD", value: 4, isUnsigned: true)
!1343 = !DIEnumerator(name: "MBA_NO_RIGHT_PAD", value: 8, isUnsigned: true)
!1344 = !{!618, !1345}
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1346, line: 20, baseType: !6)
!1346 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "")
!1347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1348, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1349, retainedTypes: !1350, splitDebugInlining: false, nameTableKind: None)
!1348 = !DIFile(filename: "../lib/mbswidth.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1349 = !{!557}
!1350 = !{!591, !1306, !627, !630}
!1351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1352, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1352 = !DIFile(filename: "../lib/mpsort.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1354, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1355, splitDebugInlining: false, nameTableKind: None)
!1354 = !DIFile(filename: "../lib/nstrftime.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1355 = !{!588, !6, !627, !926, !1306, !1356, !630, !617, !593, !1357, !1358, !591, !618, !628}
!1356 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1357 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1358 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1360, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1155, splitDebugInlining: false, nameTableKind: None)
!1360 = !DIFile(filename: "../lib/malloc/scratch_buffer_dupfree.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1362, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1155, splitDebugInlining: false, nameTableKind: None)
!1362 = !DIFile(filename: "../lib/malloc/scratch_buffer_grow.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1363 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1364, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1155, splitDebugInlining: false, nameTableKind: None)
!1364 = !DIFile(filename: "../lib/malloc/scratch_buffer_grow_preserve.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1366, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1366 = !DIFile(filename: "../lib/se-selinux.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1368, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1155, splitDebugInlining: false, nameTableKind: None)
!1368 = !DIFile(filename: "../lib/setlocale_null.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1370, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1370 = !DIFile(filename: "../lib/stat-time.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1372, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1372 = !DIFile(filename: "../lib/timespec.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1374, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1375, retainedTypes: !1379, splitDebugInlining: false, nameTableKind: None)
!1374 = !DIFile(filename: "../lib/version-etc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1375 = !{!1376}
!1376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1374, line: 40, baseType: !6, size: 32, elements: !1377)
!1377 = !{!1378}
!1378 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2021, isUnsigned: true)
!1379 = !{!588, !618}
!1380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1381, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1382, retainedTypes: !1397, splitDebugInlining: false, nameTableKind: None)
!1381 = !DIFile(filename: "../lib/xmalloc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1382 = !{!1383, !1389}
!1383 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1384, file: !1381, line: 183, baseType: !6, size: 32, elements: !1387)
!1384 = distinct !DISubprogram(name: "x2nrealloc", scope: !1381, file: !1381, line: 171, type: !1385, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1380, retainedNodes: !95)
!1385 = !DISubroutineType(types: !1386)
!1386 = !{!618, !618, !590, !591}
!1387 = !{!1388}
!1388 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!1389 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1390, file: !1381, line: 225, baseType: !6, size: 32, elements: !1387)
!1390 = distinct !DISubprogram(name: "xpalloc", scope: !1381, file: !1381, line: 218, type: !1391, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1380, retainedNodes: !95)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!618, !618, !1393, !1394, !1396, !1394}
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1395, line: 125, baseType: !1396)
!1395 = !DIFile(filename: "../lib/idx.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !592, line: 35, baseType: !617)
!1397 = !{!585, !618, !1394, !926, !6, !1306, !1356, !630, !627, !617, !593, !1357, !1358}
!1398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1399, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1162, splitDebugInlining: false, nameTableKind: None)
!1399 = !DIFile(filename: "../lib/xalloc-die.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1401, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1402, splitDebugInlining: false, nameTableKind: None)
!1401 = !DIFile(filename: "../lib/xdectoumax.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1402 = !{!142}
!1403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1404, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1155, splitDebugInlining: false, nameTableKind: None)
!1404 = !DIFile(filename: "../lib/xgethostname.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1406, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1402, retainedTypes: !1162, splitDebugInlining: false, nameTableKind: None)
!1406 = !DIFile(filename: "../lib/xstrtol-error.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1407 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1408, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1409, retainedTypes: !1410, splitDebugInlining: false, nameTableKind: None)
!1408 = !DIFile(filename: "../lib/xstrtoumax.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1409 = !{!142, !557}
!1410 = !{!627, !630}
!1411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1412, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1412 = !DIFile(filename: "../lib/free.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1414, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1415, splitDebugInlining: false, nameTableKind: None)
!1414 = !DIFile(filename: "../lib/mbrtowc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1415 = !{!591}
!1416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1417, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1418, retainedTypes: !1298, globals: !1422, splitDebugInlining: false, nameTableKind: None)
!1417 = !DIFile(filename: "../lib/time_rz.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1418 = !{!1419}
!1419 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1417, line: 46, baseType: !6, size: 32, elements: !1420)
!1420 = !{!1421}
!1421 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119, isUnsigned: true)
!1422 = !{!1423}
!1423 = !DIGlobalVariableExpression(var: !1424, expr: !DIExpression())
!1424 = distinct !DIGlobalVariable(name: "local_tz", scope: !1416, file: !1417, line: 51, type: !1425, isLocal: true, isDefinition: true)
!1425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1426)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !752, line: 856, baseType: !1427)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !1429, line: 21, size: 128, elements: !1430)
!1429 = !DIFile(filename: "../lib/time-internal.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1430 = !{!1431, !1432, !1433}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1428, file: !1429, line: 25, baseType: !1427, size: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !1428, file: !1429, line: 36, baseType: !586, size: 8, offset: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !1428, file: !1429, line: 48, baseType: !780, offset: 72)
!1434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1435, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1436, splitDebugInlining: false, nameTableKind: None)
!1435 = !DIFile(filename: "../lib/bitrotate.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1436 = !{!6}
!1437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1438, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1303, splitDebugInlining: false, nameTableKind: None)
!1438 = !DIFile(filename: "../lib/c-strcasecmp.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1440, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1440 = !DIFile(filename: "../lib/close-stream.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1441 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1442, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1442 = !DIFile(filename: "../lib/hash-pjw.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1444, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1155, splitDebugInlining: false, nameTableKind: None)
!1444 = !DIFile(filename: "../lib/ialloc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1446, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1447, retainedTypes: !1155, splitDebugInlining: false, nameTableKind: None)
!1446 = !DIFile(filename: "../lib/localcharset.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1447 = !{!165}
!1448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1449, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, splitDebugInlining: false, nameTableKind: None)
!1449 = !DIFile(filename: "../lib/fclose.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1451, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1155, splitDebugInlining: false, nameTableKind: None)
!1451 = !DIFile(filename: "../lib/fflush.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1453, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !95, retainedTypes: !1155, splitDebugInlining: false, nameTableKind: None)
!1453 = !DIFile(filename: "../lib/fseeko.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1454 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!1455 = !{i32 7, !"Dwarf Version", i32 4}
!1456 = !{i32 2, !"Debug Info Version", i32 3}
!1457 = !{i32 1, !"wchar_size", i32 4}
!1458 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1642, type: !861, scopeLine: 1643, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !95)
!1459 = !DILocalVariable(name: "argc", arg: 1, scope: !1458, file: !3, line: 1642, type: !627)
!1460 = !DILocation(line: 0, scope: !1458)
!1461 = !DILocalVariable(name: "argv", arg: 2, scope: !1458, file: !3, line: 1642, type: !584)
!1462 = !DILocation(line: 1649, column: 21, scope: !1458)
!1463 = !DILocation(line: 1649, column: 3, scope: !1458)
!1464 = !DILocation(line: 1650, column: 3, scope: !1458)
!1465 = !DILocation(line: 1654, column: 3, scope: !1458)
!1466 = !DILocation(line: 1655, column: 3, scope: !1458)
!1467 = !DILocation(line: 1660, column: 15, scope: !1458)
!1468 = !DILocation(line: 1661, column: 18, scope: !1458)
!1469 = !DILocation(line: 1662, column: 16, scope: !1458)
!1470 = !DILocation(line: 1664, column: 23, scope: !1458)
!1471 = !DILocation(line: 1665, column: 24, scope: !1458)
!1472 = !DILocation(line: 1667, column: 7, scope: !1458)
!1473 = !DILocalVariable(name: "i", scope: !1458, file: !3, line: 1644, type: !627)
!1474 = !DILocation(line: 1669, column: 7, scope: !1475)
!1475 = distinct !DILexicalBlock(scope: !1458, file: !3, line: 1669, column: 7)
!1476 = !DILocation(line: 1669, column: 7, scope: !1458)
!1477 = !DILocation(line: 1670, column: 5, scope: !1475)
!1478 = !DILocation(line: 1675, column: 7, scope: !1479)
!1479 = distinct !DILexicalBlock(scope: !1458, file: !3, line: 1675, column: 7)
!1480 = !DILocation(line: 1675, column: 7, scope: !1458)
!1481 = !DILocation(line: 1680, column: 15, scope: !1482)
!1482 = distinct !DILexicalBlock(scope: !1479, file: !3, line: 1676, column: 5)
!1483 = !DILocation(line: 1681, column: 5, scope: !1482)
!1484 = !DILocation(line: 1683, column: 7, scope: !1485)
!1485 = distinct !DILexicalBlock(scope: !1458, file: !3, line: 1683, column: 7)
!1486 = !DILocation(line: 1683, column: 7, scope: !1458)
!1487 = !DILocation(line: 1684, column: 24, scope: !1485)
!1488 = !DILocation(line: 1684, column: 5, scope: !1485)
!1489 = !DILocation(line: 1685, column: 12, scope: !1490)
!1490 = distinct !DILexicalBlock(scope: !1485, file: !3, line: 1685, column: 12)
!1491 = !DILocation(line: 1685, column: 12, scope: !1485)
!1492 = !DILocation(line: 1688, column: 11, scope: !1493)
!1493 = distinct !DILexicalBlock(scope: !1494, file: !3, line: 1688, column: 11)
!1494 = distinct !DILexicalBlock(scope: !1490, file: !3, line: 1686, column: 5)
!1495 = !DILocation(line: 1689, column: 11, scope: !1493)
!1496 = !DILocation(line: 1689, column: 15, scope: !1493)
!1497 = !DILocation(line: 1689, column: 35, scope: !1493)
!1498 = !DILocation(line: 1689, column: 38, scope: !1493)
!1499 = !DILocation(line: 1690, column: 11, scope: !1493)
!1500 = !DILocation(line: 1690, column: 15, scope: !1493)
!1501 = !DILocation(line: 1690, column: 38, scope: !1493)
!1502 = !DILocation(line: 1690, column: 41, scope: !1493)
!1503 = !DILocation(line: 1690, column: 48, scope: !1493)
!1504 = !DILocation(line: 1688, column: 11, scope: !1494)
!1505 = !DILocation(line: 1691, column: 28, scope: !1493)
!1506 = !DILocation(line: 1691, column: 9, scope: !1493)
!1507 = !DILocation(line: 1692, column: 5, scope: !1494)
!1508 = !DILocation(line: 1694, column: 7, scope: !1509)
!1509 = distinct !DILexicalBlock(scope: !1458, file: !3, line: 1694, column: 7)
!1510 = !DILocation(line: 1694, column: 19, scope: !1509)
!1511 = !DILocation(line: 1694, column: 7, scope: !1458)
!1512 = !DILocation(line: 1695, column: 21, scope: !1509)
!1513 = !DILocation(line: 1696, column: 21, scope: !1509)
!1514 = !DILocation(line: 1696, column: 24, scope: !1509)
!1515 = !DILocation(line: 1696, column: 40, scope: !1509)
!1516 = !DILocation(line: 1697, column: 21, scope: !1509)
!1517 = !DILocation(line: 1697, column: 24, scope: !1509)
!1518 = !DILocation(line: 1697, column: 31, scope: !1509)
!1519 = !DILocation(line: 1695, column: 20, scope: !1509)
!1520 = !DILocation(line: 1695, column: 17, scope: !1509)
!1521 = !DILocation(line: 1695, column: 5, scope: !1509)
!1522 = !DILocation(line: 1703, column: 7, scope: !1523)
!1523 = distinct !DILexicalBlock(scope: !1458, file: !3, line: 1703, column: 7)
!1524 = !DILocation(line: 1703, column: 7, scope: !1458)
!1525 = !DILocation(line: 1705, column: 24, scope: !1526)
!1526 = distinct !DILexicalBlock(scope: !1523, file: !3, line: 1704, column: 5)
!1527 = !DILocation(line: 1705, column: 22, scope: !1526)
!1528 = !DILocation(line: 1709, column: 11, scope: !1529)
