; ModuleID = 'nl.bc.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type { %struct.re_token_t*, i64, i64, i64*, i64*, %struct.re_node_set*, %struct.re_node_set*, %struct.re_node_set*, %struct.re_state_table_entry*, %struct.re_dfastate_t*, %struct.re_dfastate_t*, %struct.re_dfastate_t*, %struct.re_dfastate_t*, %struct.bin_tree_t*, %struct.bin_tree_storage_t*, i64*, i32, i64, i64, i64, i64, i64, i8, i32, [4 x i64], i64, i64*, %union.pthread_mutex_t }
%struct.re_token_t = type { %union.anon.35, i24 }
%union.anon.35 = type { i64* }
%struct.re_node_set = type { i64, i64, i64* }
%struct.re_state_table_entry = type { i64, i64, %struct.re_dfastate_t** }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 150, type: !136, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !35, globals: !42, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../src/nl.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!4 = !{!5, !20, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../lib/quotearg.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "../lib/fadvise.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "section", file: !3, line: 61, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "Header", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "Body", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "Footer", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "Text", value: 3, isUnsigned: true)
!35 = !{!36, !39, !40, !41}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!42 = !{!43, !45, !72, !74, !76, !81, !83, !85, !87, !89, !91, !103, !0, !109, !124, !126, !128, !130, !132, !134, !137, !139, !141, !143, !148, !150, !155, !157, !159, !164, !166, !168, !170, !172, !175, !177}
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "current_type", scope: !2, file: !3, line: 76, type: !36, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "body_regex", scope: !2, file: !3, line: 79, type: !47, isLocal: true, isDefinition: true)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !48, line: 413, size: 512, elements: !49)
!48 = !DIFile(filename: "../lib/regex.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!49 = !{!50, !53, !57, !58, !60, !61, !64, !65, !66, !67, !68, !69, !70, !71}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !47, file: !48, line: 417, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !48, line: 417, flags: DIFlagFwdDecl)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !47, file: !48, line: 420, baseType: !54, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !48, line: 49, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !41)
!56 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !47, file: !48, line: 423, baseType: !54, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !47, file: !48, line: 426, baseType: !59, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !48, line: 72, baseType: !41)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !47, file: !48, line: 431, baseType: !39, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !47, file: !48, line: 437, baseType: !62, size: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !47, file: !48, line: 440, baseType: !55, size: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !47, file: !48, line: 446, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !47, file: !48, line: 457, baseType: !7, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !47, file: !48, line: 461, baseType: !7, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !47, file: !48, line: 465, baseType: !7, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !47, file: !48, line: 469, baseType: !7, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !47, file: !48, line: 472, baseType: !7, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !47, file: !48, line: 475, baseType: !7, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "header_regex", scope: !2, file: !3, line: 82, type: !47, isLocal: true, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "footer_regex", scope: !2, file: !3, line: 85, type: !47, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "body_fastmap", scope: !2, file: !3, line: 88, type: !78, isLocal: true, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 256)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "header_fastmap", scope: !2, file: !3, line: 89, type: !78, isLocal: true, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "footer_fastmap", scope: !2, file: !3, line: 90, type: !78, isLocal: true, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "header_del_len", scope: !2, file: !3, line: 105, type: !55, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "body_del_len", scope: !2, file: !3, line: 111, type: !55, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "footer_del_len", scope: !2, file: !3, line: 117, type: !55, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "line_buf", scope: !2, file: !3, line: 120, type: !93, isLocal: true, isDefinition: true)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !94, line: 27, size: 192, elements: !95)
!94 = !DIFile(filename: "../lib/linebuffer.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!95 = !{!96, !101, !102}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !93, file: !94, line: 29, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !98, line: 125, baseType: !99)
!98 = !DIFile(filename: "../lib/idx.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !56, line: 35, baseType: !100)
!100 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !93, file: !94, line: 30, baseType: !97, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !93, file: !94, line: 31, baseType: !39, size: 64, offset: 128)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "line_no", scope: !2, file: !3, line: 144, type: !105, isLocal: true, isDefinition: true)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !106, line: 101, baseType: !107)
!106 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !108, line: 72, baseType: !100)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 152, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 3584, elements: !122)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !114, line: 50, size: 256, elements: !115)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!115 = !{!116, !117, !119, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 52, baseType: !36, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !113, file: !114, line: 55, baseType: !118, size: 32, offset: 64)
!118 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !114, line: 56, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !113, file: !114, line: 57, baseType: !118, size: 32, offset: 192)
!122 = !{!123}
!123 = !DISubrange(count: 14)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "header_type", scope: !2, file: !3, line: 70, type: !36, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "body_type", scope: !2, file: !3, line: 67, type: !36, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "footer_type", scope: !2, file: !3, line: 73, type: !36, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "starting_line_number", scope: !2, file: !3, line: 126, type: !105, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "page_incr", scope: !2, file: !3, line: 129, type: !105, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "reset_numbers", scope: !2, file: !3, line: 132, type: !136, isLocal: true, isDefinition: true)
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "blank_join", scope: !2, file: !3, line: 135, type: !105, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "separator_str", scope: !2, file: !3, line: 96, type: !36, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "lineno_width", scope: !2, file: !3, line: 138, type: !118, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "FORMAT_LEFT", scope: !2, file: !3, line: 54, type: !145, isLocal: true, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 8)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "lineno_format", scope: !2, file: !3, line: 141, type: !36, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_NOLZ", scope: !2, file: !3, line: 48, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 56, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 7)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_LZ", scope: !2, file: !3, line: 51, type: !145, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "section_del", scope: !2, file: !3, line: 99, type: !39, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "DEFAULT_SECTION_DELIMITERS", scope: !2, file: !3, line: 57, type: !161, isLocal: true, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 24, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 3)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "header_del", scope: !2, file: !3, line: 102, type: !39, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "body_del", scope: !2, file: !3, line: 108, type: !39, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "footer_del", scope: !2, file: !3, line: 114, type: !39, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "print_no_line_fmt", scope: !2, file: !3, line: 123, type: !39, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "current_regex", scope: !2, file: !3, line: 93, type: !174, isLocal: true, isDefinition: true)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "line_no_overflow", scope: !2, file: !3, line: 147, type: !136, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "blank_lines", scope: !179, file: !3, line: 340, type: !105, isLocal: true, isDefinition: true)
!179 = distinct !DISubprogram(name: "proc_text", scope: !3, file: !3, line: 338, type: !180, scopeLine: 339, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !182)
!180 = !DISubroutineType(types: !181)
!181 = !{null}
!182 = !{}
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "Version", scope: !185, file: !186, line: 2, type: !36, isLocal: false, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !182, globals: !187, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "src/version.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!187 = !{!183}
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "file_name", scope: !190, file: !191, line: 46, type: !36, isLocal: true, isDefinition: true)
!190 = distinct !DICompileUnit(language: DW_LANG_C99, file: !191, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !182, retainedTypes: !192, globals: !193, splitDebugInlining: false, nameTableKind: None)
!191 = !DIFile(filename: "../lib/closeout.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!192 = !{!36}
!193 = !{!188, !194}
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !190, file: !191, line: 56, type: !136, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "exit_failure", scope: !198, file: !199, line: 24, type: !201, isLocal: false, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !182, globals: !200, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "../lib/exitfail.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!200 = !{!196}
!201 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !118)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "program_name", scope: !204, file: !205, line: 33, type: !36, isLocal: false, isDefinition: true)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !182, retainedTypes: !206, globals: !207, splitDebugInlining: false, nameTableKind: None)
!205 = !DIFile(filename: "../lib/progname.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!206 = !{!40, !39}
!207 = !{!202}
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !210, file: !211, line: 78, type: !267, isLocal: false, isDefinition: true)
!210 = distinct !DICompileUnit(language: DW_LANG_C99, file: !211, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !212, retainedTypes: !233, globals: !235, splitDebugInlining: false, nameTableKind: None)
!211 = !DIFile(filename: "../lib/quotearg.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!212 = !{!5, !213, !218}
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!216 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!217 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!218 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !219, line: 46, baseType: !7, size: 32, elements: !220)
!219 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232}
!221 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!222 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!223 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!224 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!225 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!226 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!227 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!228 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!229 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!230 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!231 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!232 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!233 = !{!118, !234, !55, !36}
!234 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!235 = !{!208, !236, !242, !252, !254, !256, !263, !265}
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !210, file: !211, line: 94, type: !238, isLocal: false, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 320, elements: !240)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!240 = !{!241}
!241 = !DISubrange(count: 10)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !210, file: !211, line: 1044, type: !244, isLocal: false, isDefinition: true)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !211, line: 58, size: 448, elements: !245)
!245 = !{!246, !247, !248, !250, !251}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !244, file: !211, line: 61, baseType: !5, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !244, file: !211, line: 64, baseType: !118, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !244, file: !211, line: 68, baseType: !249, size: 256, offset: 64)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !146)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !244, file: !211, line: 71, baseType: !36, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !244, file: !211, line: 74, baseType: !36, size: 64, offset: 384)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !210, file: !211, line: 109, type: !244, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "slot0", scope: !210, file: !211, line: 834, type: !78, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "slotvec", scope: !210, file: !211, line: 837, type: !258, isLocal: true, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !211, line: 826, size: 128, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !259, file: !211, line: 828, baseType: !55, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !259, file: !211, line: 829, baseType: !39, size: 64, offset: 64)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "nslots", scope: !210, file: !211, line: 835, type: !118, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "slotvec0", scope: !210, file: !211, line: 836, type: !259, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 704, elements: !269)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!269 = !{!270}
!270 = !DISubrange(count: 11)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !273, file: !274, line: 26, type: !276, isLocal: false, isDefinition: true)
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !182, globals: !275, splitDebugInlining: false, nameTableKind: None)
!274 = !DIFile(filename: "../lib/version-etc-fsf.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!275 = !{!271}
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 376, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 47)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "rpl_re_syntax_options", scope: !281, file: !998, line: 243, type: !59, isLocal: false, isDefinition: true)
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !283, retainedTypes: !746, globals: !995, splitDebugInlining: false, nameTableKind: None)
!282 = !DIFile(filename: "../lib/regex.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!283 = !{!284, !297, !333, !353, !218, !739}
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 218, baseType: !7, size: 32, elements: !286)
!285 = !DIFile(filename: "../lib/regex_internal.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!287 = !DIEnumerator(name: "INSIDE_WORD", value: 5, isUnsigned: true)
!288 = !DIEnumerator(name: "WORD_FIRST", value: 6, isUnsigned: true)
!289 = !DIEnumerator(name: "WORD_LAST", value: 9, isUnsigned: true)
!290 = !DIEnumerator(name: "INSIDE_NOTWORD", value: 10, isUnsigned: true)
!291 = !DIEnumerator(name: "LINE_FIRST", value: 16, isUnsigned: true)
!292 = !DIEnumerator(name: "LINE_LAST", value: 32, isUnsigned: true)
!293 = !DIEnumerator(name: "BUF_FIRST", value: 64, isUnsigned: true)
!294 = !DIEnumerator(name: "BUF_LAST", value: 128, isUnsigned: true)
!295 = !DIEnumerator(name: "WORD_DELIM", value: 256, isUnsigned: true)
!296 = !DIEnumerator(name: "NOT_WORD_DELIM", value: 512, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 239, baseType: !7, size: 32, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!299 = !DIEnumerator(name: "NON_TYPE", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "CHARACTER", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "END_OF_RE", value: 2, isUnsigned: true)
!302 = !DIEnumerator(name: "SIMPLE_BRACKET", value: 3, isUnsigned: true)
!303 = !DIEnumerator(name: "OP_BACK_REF", value: 4, isUnsigned: true)
!304 = !DIEnumerator(name: "OP_PERIOD", value: 5, isUnsigned: true)
!305 = !DIEnumerator(name: "COMPLEX_BRACKET", value: 6, isUnsigned: true)
!306 = !DIEnumerator(name: "OP_UTF8_PERIOD", value: 7, isUnsigned: true)
!307 = !DIEnumerator(name: "OP_OPEN_SUBEXP", value: 8, isUnsigned: true)
!308 = !DIEnumerator(name: "OP_CLOSE_SUBEXP", value: 9, isUnsigned: true)
!309 = !DIEnumerator(name: "OP_ALT", value: 10, isUnsigned: true)
!310 = !DIEnumerator(name: "OP_DUP_ASTERISK", value: 11, isUnsigned: true)
!311 = !DIEnumerator(name: "ANCHOR", value: 12, isUnsigned: true)
!312 = !DIEnumerator(name: "CONCAT", value: 16, isUnsigned: true)
!313 = !DIEnumerator(name: "SUBEXP", value: 17, isUnsigned: true)
!314 = !DIEnumerator(name: "OP_DUP_PLUS", value: 18, isUnsigned: true)
!315 = !DIEnumerator(name: "OP_DUP_QUESTION", value: 19, isUnsigned: true)
!316 = !DIEnumerator(name: "OP_OPEN_BRACKET", value: 20, isUnsigned: true)
!317 = !DIEnumerator(name: "OP_CLOSE_BRACKET", value: 21, isUnsigned: true)
!318 = !DIEnumerator(name: "OP_CHARSET_RANGE", value: 22, isUnsigned: true)
!319 = !DIEnumerator(name: "OP_OPEN_DUP_NUM", value: 23, isUnsigned: true)
!320 = !DIEnumerator(name: "OP_CLOSE_DUP_NUM", value: 24, isUnsigned: true)
!321 = !DIEnumerator(name: "OP_NON_MATCH_LIST", value: 25, isUnsigned: true)
!322 = !DIEnumerator(name: "OP_OPEN_COLL_ELEM", value: 26, isUnsigned: true)
!323 = !DIEnumerator(name: "OP_CLOSE_COLL_ELEM", value: 27, isUnsigned: true)
!324 = !DIEnumerator(name: "OP_OPEN_EQUIV_CLASS", value: 28, isUnsigned: true)
!325 = !DIEnumerator(name: "OP_CLOSE_EQUIV_CLASS", value: 29, isUnsigned: true)
!326 = !DIEnumerator(name: "OP_OPEN_CHAR_CLASS", value: 30, isUnsigned: true)
!327 = !DIEnumerator(name: "OP_CLOSE_CHAR_CLASS", value: 31, isUnsigned: true)
!328 = !DIEnumerator(name: "OP_WORD", value: 32, isUnsigned: true)
!329 = !DIEnumerator(name: "OP_NOTWORD", value: 33, isUnsigned: true)
!330 = !DIEnumerator(name: "OP_SPACE", value: 34, isUnsigned: true)
!331 = !DIEnumerator(name: "OP_NOTSPACE", value: 35, isUnsigned: true)
!332 = !DIEnumerator(name: "BACK_SLASH", value: 36, isUnsigned: true)
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 346, baseType: !118, size: 32, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352}
!335 = !DIEnumerator(name: "_REG_ENOSYS", value: -1)
!336 = !DIEnumerator(name: "_REG_NOERROR", value: 0)
!337 = !DIEnumerator(name: "_REG_NOMATCH", value: 1)
!338 = !DIEnumerator(name: "_REG_BADPAT", value: 2)
!339 = !DIEnumerator(name: "_REG_ECOLLATE", value: 3)
!340 = !DIEnumerator(name: "_REG_ECTYPE", value: 4)
!341 = !DIEnumerator(name: "_REG_EESCAPE", value: 5)
!342 = !DIEnumerator(name: "_REG_ESUBREG", value: 6)
!343 = !DIEnumerator(name: "_REG_EBRACK", value: 7)
!344 = !DIEnumerator(name: "_REG_EPAREN", value: 8)
!345 = !DIEnumerator(name: "_REG_EBRACE", value: 9)
!346 = !DIEnumerator(name: "_REG_BADBR", value: 10)
!347 = !DIEnumerator(name: "_REG_ERANGE", value: 11)
!348 = !DIEnumerator(name: "_REG_ESPACE", value: 12)
!349 = !DIEnumerator(name: "_REG_BADRPT", value: 13)
!350 = !DIEnumerator(name: "_REG_EEND", value: 14)
!351 = !DIEnumerator(name: "_REG_ESIZE", value: 15)
!352 = !DIEnumerator(name: "_REG_ERPAREN", value: 16)
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 41, baseType: !7, size: 32, elements: !355)
!354 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!355 = !{!356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738}
!356 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!357 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!358 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!359 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!360 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!361 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!362 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!363 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!364 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!365 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!366 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!367 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!368 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!369 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!370 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!371 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!372 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!373 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!374 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!375 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!376 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!377 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!378 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!379 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!380 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!381 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!382 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!383 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!384 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!385 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!386 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!387 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!388 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!389 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!390 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!391 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!392 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!393 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!394 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!395 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!396 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!397 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!398 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!399 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!400 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!401 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!402 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!403 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!404 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!405 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!464 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!467 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!468 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!469 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!470 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!471 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!472 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!473 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!474 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!475 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!476 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!477 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!478 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!551 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!624 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!625 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!626 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!627 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!628 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!629 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!630 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!631 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!632 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!633 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!634 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!635 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!636 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!637 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!638 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!640 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!641 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!642 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!643 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!644 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!645 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!671 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!672 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!673 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!674 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!675 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!680 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!681 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!682 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!683 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!739 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 692, baseType: !7, size: 32, elements: !740)
!740 = !{!741, !742, !743, !744, !745}
!741 = !DIEnumerator(name: "SB_CHAR", value: 0, isUnsigned: true)
!742 = !DIEnumerator(name: "MB_CHAR", value: 1, isUnsigned: true)
!743 = !DIEnumerator(name: "EQUIV_CLASS", value: 2, isUnsigned: true)
!744 = !DIEnumerator(name: "COLL_SYM", value: 3, isUnsigned: true)
!745 = !DIEnumerator(name: "CHAR_CLASS", value: 4, isUnsigned: true)
!746 = !{!41, !118, !39, !40, !36, !55, !747, !62, !748, !753, !762, !921, !923, !803, !771, !234, !924, !861, !765, !770, !775, !926, !806, !927, !823, !822, !946, !952, !63, !829, !953, !962, !980, !988}
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset_word_t", file: !285, line: 194, baseType: !41)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_dfa_t", file: !285, line: 428, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !285, line: 638, size: 2176, elements: !751)
!751 = !{!752, !800, !801, !802, !804, !805, !813, !814, !815, !843, !844, !845, !846, !847, !860, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !889, !890, !891}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !750, file: !285, line: 640, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_token_t", file: !285, line: 365, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 338, size: 128, elements: !756)
!756 = !{!757, !792, !794, !795, !796, !797, !798, !799}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "opr", scope: !755, file: !285, line: 349, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !755, file: !285, line: 340, size: 64, elements: !759)
!759 = !{!760, !761, !764, !789, !790}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !758, file: !285, line: 342, baseType: !63, size: 8)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sbcset", scope: !758, file: !285, line: 343, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_bitset_ptr_t", file: !285, line: 204, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mbcset", scope: !758, file: !285, line: 345, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_charset_t", file: !285, line: 335, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 291, size: 640, elements: !768)
!768 = !{!769, !772, !773, !774, !778, !779, !785, !786, !787, !788}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mbchars", scope: !767, file: !285, line: 294, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !56, line: 74, baseType: !118)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "range_starts", scope: !767, file: !285, line: 311, baseType: !770, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "range_ends", scope: !767, file: !285, line: 312, baseType: !770, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "char_classes", scope: !767, file: !285, line: 316, baseType: !775, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !777, line: 38, baseType: !41)
!777 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/wctype-wchar.h", directory: "")
!778 = !DIDerivedType(tag: DW_TAG_member, name: "non_match", scope: !767, file: !285, line: 319, baseType: !7, size: 1, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "nmbchars", scope: !767, file: !285, line: 322, baseType: !780, size: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "Idx", file: !285, line: 182, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !48, line: 486, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !783, line: 108, baseType: !784)
!783 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !108, line: 193, baseType: !100)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ncoll_syms", scope: !767, file: !285, line: 325, baseType: !780, size: 64, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "nequiv_classes", scope: !767, file: !285, line: 328, baseType: !780, size: 64, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "nranges", scope: !767, file: !285, line: 331, baseType: !780, size: 64, offset: 512)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "nchar_classes", scope: !767, file: !285, line: 334, baseType: !780, size: 64, offset: 576)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !758, file: !285, line: 347, baseType: !780, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_type", scope: !758, file: !285, line: 348, baseType: !791, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_context_type", file: !285, line: 230, baseType: !284)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !755, file: !285, line: 351, baseType: !793, size: 8, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_token_type_t", file: !285, line: 288, baseType: !297)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "constraint", scope: !755, file: !285, line: 355, baseType: !7, size: 10, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "duplicated", scope: !755, file: !285, line: 356, baseType: !7, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "opt_subexp", scope: !755, file: !285, line: 357, baseType: !7, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mb", scope: !755, file: !285, line: 359, baseType: !7, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partial", scope: !755, file: !285, line: 362, baseType: !7, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "word_char", scope: !755, file: !285, line: 364, baseType: !7, size: 1, offset: 86, flags: DIFlagBitField, extraData: i64 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "nodes_alloc", scope: !750, file: !285, line: 641, baseType: !55, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "nodes_len", scope: !750, file: !285, line: 642, baseType: !55, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "nexts", scope: !750, file: !285, line: 643, baseType: !803, size: 64, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "org_indices", scope: !750, file: !285, line: 644, baseType: !803, size: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "edests", scope: !750, file: !285, line: 645, baseType: !806, size: 64, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_node_set", file: !285, line: 237, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 232, size: 192, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !808, file: !285, line: 234, baseType: !780, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "nelem", scope: !808, file: !285, line: 235, baseType: !780, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !808, file: !285, line: 236, baseType: !803, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "eclosures", scope: !750, file: !285, line: 646, baseType: !806, size: 64, offset: 384)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "inveclosures", scope: !750, file: !285, line: 647, baseType: !806, size: 64, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "state_table", scope: !750, file: !285, line: 648, baseType: !816, size: 64, offset: 512)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_state_table_entry", file: !285, line: 542, size: 192, elements: !818)
!818 = !{!819, !820, !821}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !817, file: !285, line: 544, baseType: !780, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !817, file: !285, line: 545, baseType: !780, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !817, file: !285, line: 546, baseType: !822, size: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_dfastate_t", file: !285, line: 540, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfastate_t", file: !285, line: 522, size: 896, elements: !826)
!826 = !{!827, !830, !831, !832, !833, !834, !837, !838, !839, !840, !841, !842}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !825, file: !285, line: 524, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_hashval_t", file: !285, line: 190, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !48, line: 45, baseType: !55)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !825, file: !285, line: 525, baseType: !807, size: 192, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "non_eps_nodes", scope: !825, file: !285, line: 526, baseType: !807, size: 192, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "inveclosure", scope: !825, file: !285, line: 527, baseType: !807, size: 192, offset: 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "entrance_nodes", scope: !825, file: !285, line: 528, baseType: !806, size: 64, offset: 640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "trtable", scope: !825, file: !285, line: 529, baseType: !835, size: 64, offset: 704)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "word_trtable", scope: !825, file: !285, line: 529, baseType: !835, size: 64, offset: 768)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !825, file: !285, line: 530, baseType: !7, size: 4, offset: 832, flags: DIFlagBitField, extraData: i64 832)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "halt", scope: !825, file: !285, line: 531, baseType: !7, size: 1, offset: 836, flags: DIFlagBitField, extraData: i64 832)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mb", scope: !825, file: !285, line: 535, baseType: !7, size: 1, offset: 837, flags: DIFlagBitField, extraData: i64 832)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "has_backref", scope: !825, file: !285, line: 537, baseType: !7, size: 1, offset: 838, flags: DIFlagBitField, extraData: i64 832)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "has_constraint", scope: !825, file: !285, line: 538, baseType: !7, size: 1, offset: 839, flags: DIFlagBitField, extraData: i64 832)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !750, file: !285, line: 649, baseType: !823, size: 64, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "init_state_word", scope: !750, file: !285, line: 650, baseType: !823, size: 64, offset: 640)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "init_state_nl", scope: !750, file: !285, line: 651, baseType: !823, size: 64, offset: 704)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "init_state_begbuf", scope: !750, file: !285, line: 652, baseType: !823, size: 64, offset: 768)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "str_tree", scope: !750, file: !285, line: 653, baseType: !848, size: 64, offset: 832)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_tree_t", file: !285, line: 482, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_tree_t", file: !285, line: 468, size: 512, elements: !851)
!851 = !{!852, !854, !855, !856, !857, !858, !859}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !850, file: !285, line: 470, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !850, file: !285, line: 471, baseType: !853, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !850, file: !285, line: 472, baseType: !853, size: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !850, file: !285, line: 473, baseType: !853, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !850, file: !285, line: 474, baseType: !853, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !850, file: !285, line: 476, baseType: !754, size: 128, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "node_idx", scope: !850, file: !285, line: 480, baseType: !780, size: 64, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "str_tree_storage", scope: !750, file: !285, line: 654, baseType: !861, size: 64, offset: 896)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_tree_storage_t", file: !285, line: 492, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_tree_storage_t", file: !285, line: 487, size: 7744, elements: !864)
!864 = !{!865, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !863, file: !285, line: 489, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !863, file: !285, line: 490, baseType: !868, size: 7680, offset: 64)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !849, size: 7680, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 15)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "sb_char", scope: !750, file: !285, line: 655, baseType: !762, size: 64, offset: 960)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "str_tree_storage_idx", scope: !750, file: !285, line: 656, baseType: !118, size: 32, offset: 1024)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "state_hash_mask", scope: !750, file: !285, line: 659, baseType: !828, size: 64, offset: 1088)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "init_node", scope: !750, file: !285, line: 660, baseType: !780, size: 64, offset: 1152)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "nbackref", scope: !750, file: !285, line: 661, baseType: !780, size: 64, offset: 1216)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "used_bkref_map", scope: !750, file: !285, line: 664, baseType: !747, size: 64, offset: 1280)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "completed_bkref_map", scope: !750, file: !285, line: 665, baseType: !747, size: 64, offset: 1344)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "has_plural_match", scope: !750, file: !285, line: 667, baseType: !7, size: 1, offset: 1408, flags: DIFlagBitField, extraData: i64 1408)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "has_mb_node", scope: !750, file: !285, line: 671, baseType: !7, size: 1, offset: 1409, flags: DIFlagBitField, extraData: i64 1408)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "is_utf8", scope: !750, file: !285, line: 672, baseType: !7, size: 1, offset: 1410, flags: DIFlagBitField, extraData: i64 1408)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "map_notascii", scope: !750, file: !285, line: 673, baseType: !7, size: 1, offset: 1411, flags: DIFlagBitField, extraData: i64 1408)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "word_ops_used", scope: !750, file: !285, line: 674, baseType: !7, size: 1, offset: 1412, flags: DIFlagBitField, extraData: i64 1408)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !750, file: !285, line: 675, baseType: !118, size: 32, offset: 1440)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "word_char", scope: !750, file: !285, line: 676, baseType: !885, size: 256, offset: 1472)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset_t", file: !285, line: 203, baseType: !886)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 256, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 4)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !750, file: !285, line: 677, baseType: !59, size: 64, offset: 1728)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "subexp_map", scope: !750, file: !285, line: 678, baseType: !803, size: 64, offset: 1792)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !750, file: !285, line: 682, baseType: !892, size: 320, offset: 1856)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !893, line: 72, baseType: !894)
!893 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "")
!894 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !893, line: 67, size: 320, elements: !895)
!895 = !{!896, !916, !920}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !894, file: !893, line: 69, baseType: !897, size: 320)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !898, line: 22, size: 320, elements: !899)
!898 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "")
!899 = !{!900, !901, !902, !903, !904, !905, !907, !908}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !897, file: !898, line: 24, baseType: !118, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !897, file: !898, line: 25, baseType: !7, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !897, file: !898, line: 26, baseType: !118, size: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !897, file: !898, line: 28, baseType: !7, size: 32, offset: 96)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !897, file: !898, line: 32, baseType: !118, size: 32, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !897, file: !898, line: 34, baseType: !906, size: 16, offset: 160)
!906 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !897, file: !898, line: 35, baseType: !906, size: 16, offset: 176)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !897, file: !898, line: 36, baseType: !909, size: 128, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !910, line: 53, baseType: !911)
!910 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "")
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !910, line: 49, size: 128, elements: !912)
!912 = !{!913, !915}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !911, file: !910, line: 51, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !911, file: !910, line: 52, baseType: !914, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !894, file: !893, line: 70, baseType: !917, size: 320)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 320, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 40)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !894, file: !893, line: 71, baseType: !100, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !925, line: 20, baseType: !7)
!925 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "")
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !106, line: 90, baseType: !41)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "regex_t", file: !48, line: 478, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !48, line: 413, size: 512, elements: !930)
!930 = !{!931, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !929, file: !48, line: 417, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !929, file: !48, line: 420, baseType: !54, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !929, file: !48, line: 423, baseType: !54, size: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !929, file: !48, line: 426, baseType: !59, size: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !929, file: !48, line: 431, baseType: !39, size: 64, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !929, file: !48, line: 437, baseType: !62, size: 64, offset: 320)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !929, file: !48, line: 440, baseType: !55, size: 64, offset: 384)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !929, file: !48, line: 446, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !929, file: !48, line: 457, baseType: !7, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !929, file: !48, line: 461, baseType: !7, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !929, file: !48, line: 465, baseType: !7, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !929, file: !48, line: 469, baseType: !7, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !929, file: !48, line: 472, baseType: !7, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !929, file: !48, line: 475, baseType: !7, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_t", file: !48, line: 521, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 517, size: 128, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "rm_so", scope: !948, file: !48, line: 519, baseType: !781, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "rm_eo", scope: !948, file: !48, line: 520, baseType: !781, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_backref_cache_entry", file: !285, line: 581, size: 384, elements: !955)
!955 = !{!956, !957, !958, !959, !960, !961}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !954, file: !285, line: 583, baseType: !780, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "str_idx", scope: !954, file: !285, line: 584, baseType: !780, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "subexp_from", scope: !954, file: !285, line: 585, baseType: !780, size: 64, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "subexp_to", scope: !954, file: !285, line: 586, baseType: !780, size: 64, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "eps_reachable_subexps_map", scope: !954, file: !285, line: 587, baseType: !747, size: 64, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "more", scope: !954, file: !285, line: 588, baseType: !38, size: 8, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_sub_match_top_t", file: !285, line: 579, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 571, size: 384, elements: !966)
!966 = !{!967, !968, !969, !977, !978, !979}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "str_idx", scope: !965, file: !285, line: 573, baseType: !780, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !965, file: !285, line: 574, baseType: !780, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !965, file: !285, line: 575, baseType: !970, size: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "state_array_t", file: !285, line: 556, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 551, size: 192, elements: !973)
!973 = !{!974, !975, !976}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "next_idx", scope: !972, file: !285, line: 553, baseType: !780, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !972, file: !285, line: 554, baseType: !780, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !972, file: !285, line: 555, baseType: !822, size: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "alasts", scope: !965, file: !285, line: 576, baseType: !780, size: 64, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "nlasts", scope: !965, file: !285, line: 577, baseType: !780, size: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "lasts", scope: !965, file: !285, line: 578, baseType: !980, size: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_sub_match_last_t", file: !285, line: 565, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 560, size: 320, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !983, file: !285, line: 562, baseType: !780, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "str_idx", scope: !983, file: !285, line: 563, baseType: !780, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !983, file: !285, line: 564, baseType: !971, size: 192, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_fail_stack_ent_t", file: !285, line: 623, size: 384, elements: !990)
!990 = !{!991, !992, !993, !994}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !989, file: !285, line: 625, baseType: !780, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !989, file: !285, line: 626, baseType: !780, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !989, file: !285, line: 627, baseType: !946, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "eps_via_nodes", scope: !989, file: !285, line: 628, baseType: !807, size: 192, offset: 192)
!995 = !{!279, !996, !1002, !1008}
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "__re_error_msgid", scope: !281, file: !998, line: 132, type: !999, isLocal: true, isDefinition: true)
!998 = !DIFile(filename: "../lib/regcomp.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 3056, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 382)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "__re_error_msgid_idx", scope: !281, file: !998, line: 186, type: !1004, isLocal: true, isDefinition: true)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 1088, elements: !1006)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!1006 = !{!1007}
!1007 = !DISubrange(count: 17)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "utf8_sb_map", scope: !281, file: !998, line: 558, type: !1010, isLocal: true, isDefinition: true)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!1011 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1012, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1013, splitDebugInlining: false, nameTableKind: None)
!1012 = !DIFile(filename: "../lib/fadvise.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1013 = !{!20}
!1014 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1015, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !182, splitDebugInlining: false, nameTableKind: None)
!1015 = !DIFile(filename: "../lib/linebuffer.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1016 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1017, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1018, retainedTypes: !1022, splitDebugInlining: false, nameTableKind: None)
!1017 = !DIFile(filename: "../lib/version-etc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1018 = !{!1019}
!1019 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1017, line: 40, baseType: !7, size: 32, elements: !1020)
!1020 = !{!1021}
!1021 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2021, isUnsigned: true)
!1022 = !{!36, !40}
!1023 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1024, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1025, retainedTypes: !1038, splitDebugInlining: false, nameTableKind: None)
!1024 = !DIFile(filename: "../lib/xmalloc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1025 = !{!1026, !1033}
!1026 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1027, file: !1024, line: 183, baseType: !7, size: 32, elements: !1031)
!1027 = distinct !DISubprogram(name: "x2nrealloc", scope: !1024, file: !1024, line: 171, type: !1028, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1023, retainedNodes: !182)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!40, !40, !1030, !55}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!1031 = !{!1032}
!1032 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!1033 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1034, file: !1024, line: 225, baseType: !7, size: 32, elements: !1031)
