; ModuleID = 'sort.bc.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.__sigset_t = type { [16 x i64] }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.keyfield = type { i64, i64, i64, i64, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, %struct.keyfield* }
%struct.line = type { i8*, i64, i8*, i8* }
%struct.tempnode = type { %struct.tempnode*, i32, i8, [0 x i8] }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.month = type { i8*, i32 }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

!506 = !DIEnumerator(name: "UNCOMPRESSED", value: 0, isUnsigned: true)
!507 = !DIEnumerator(name: "UNREAPED", value: 1, isUnsigned: true)
!508 = !DIEnumerator(name: "REAPED", value: 2, isUnsigned: true)
!509 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 131, baseType: !6, size: 32, elements: !510)
!510 = !{!511, !512}
!511 = !DIEnumerator(name: "MAX_FORK_TRIES_COMPRESS", value: 4, isUnsigned: true)
!512 = !DIEnumerator(name: "MAX_FORK_TRIES_DECOMPRESS", value: 9, isUnsigned: true)
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 680, baseType: !6, size: 32, elements: !514)
!514 = !{!515}
!515 = !DIEnumerator(name: "INIT_PROCTAB_SIZE", value: 47, isUnsigned: true)
!516 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 145, baseType: !6, size: 32, elements: !517)
!517 = !{!518, !519}
!518 = !DIEnumerator(name: "MERGE_END", value: 0, isUnsigned: true)
!519 = !DIEnumerator(name: "MERGE_ROOT", value: 1, isUnsigned: true)
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 112, baseType: !6, size: 32, elements: !521)
!521 = !{!522}
!522 = !DIEnumerator(name: "SUBTHREAD_LINES_HEURISTIC", value: 131072, isUnsigned: true)
!523 = !{!524, !526, !527, !6, !532, !16, !14, !534}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !528, line: 72, baseType: !529)
!528 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !14}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!534 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!535 = !{!536, !542, !547, !552, !554, !0, !556, !559, !563, !565, !567, !569, !571, !573, !597, !599, !601, !613, !618, !620, !622, !625, !634, !650, !655, !667, !672, !678, !681, !686, !688, !690, !693, !695, !737, !739, !760, !762, !764, !767, !773, !775, !778, !784, !786, !847}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "sig", scope: !11, file: !3, line: 4252, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 352, elements: !540)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!540 = !{!541}
!541 = !DISubrange(count: 11)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "opts", scope: !11, file: !3, line: 4672, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 80, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 10)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "opts", scope: !11, file: !3, line: 4728, type: !549, isLocal: true, isDefinition: true)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 3)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "decimal_point", scope: !2, file: !3, line: 155, type: !14, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "thousands_sep", scope: !2, file: !3, line: 158, type: !14, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "hard_LC_TIME", scope: !2, file: !3, line: 163, type: !558, isLocal: true, isDefinition: true)
!558 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "sort_size", scope: !2, file: !3, line: 315, type: !561, isLocal: true, isDefinition: true)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !562, line: 46, baseType: !497)
!562 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "temp_dir_count", scope: !2, file: !3, line: 328, type: !561, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "reverse", scope: !2, file: !3, line: 334, type: !558, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "stable", scope: !2, file: !3, line: 339, type: !558, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "unique", scope: !2, file: !3, line: 351, type: !558, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 354, type: !558, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "keylist", scope: !2, file: !3, line: 357, type: !575, isLocal: true, isDefinition: true)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "keyfield", file: !3, line: 200, size: 576, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sword", scope: !576, file: !3, line: 202, baseType: !561, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "schar", scope: !576, file: !3, line: 203, baseType: !561, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "eword", scope: !576, file: !3, line: 204, baseType: !561, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "echar", scope: !576, file: !3, line: 205, baseType: !561, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !576, file: !3, line: 206, baseType: !583, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !576, file: !3, line: 207, baseType: !524, size: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "skipsblanks", scope: !576, file: !3, line: 208, baseType: !558, size: 8, offset: 384)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "skipeblanks", scope: !576, file: !3, line: 209, baseType: !558, size: 8, offset: 392)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !576, file: !3, line: 210, baseType: !558, size: 8, offset: 400)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !576, file: !3, line: 213, baseType: !558, size: 8, offset: 408)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "general_numeric", scope: !576, file: !3, line: 214, baseType: !558, size: 8, offset: 416)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "human_numeric", scope: !576, file: !3, line: 216, baseType: !558, size: 8, offset: 424)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !576, file: !3, line: 218, baseType: !558, size: 8, offset: 432)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "reverse", scope: !576, file: !3, line: 219, baseType: !558, size: 8, offset: 440)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !576, file: !3, line: 220, baseType: !558, size: 8, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "traditional_used", scope: !576, file: !3, line: 221, baseType: !558, size: 8, offset: 456)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !576, file: !3, line: 222, baseType: !575, size: 64, offset: 512)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "compress_program", scope: !2, file: !3, line: 360, type: !524, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 363, type: !558, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 623, type: !603, isLocal: true, isDefinition: true)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !604, line: 7, baseType: !605)
!604 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sigset_t.h", directory: "")
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !606, line: 8, baseType: !607)
!606 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !606, line: 5, size: 1024, elements: !608)
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !607, file: !606, line: 7, baseType: !610, size: 1024)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 1024, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 16)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "blanks", scope: !2, file: !3, line: 268, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 2048, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 256)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "nonprinting", scope: !2, file: !3, line: 271, type: !615, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "nondictionary", scope: !2, file: !3, line: 274, type: !615, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "fold_toupper", scope: !2, file: !3, line: 277, type: !624, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2048, elements: !616)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "monthtab", scope: !2, file: !3, line: 283, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 1536, elements: !632)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "month", file: !3, line: 225, size: 128, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !628, file: !3, line: 227, baseType: !524, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !628, file: !3, line: 228, baseType: !14, size: 32, offset: 64)
!632 = !{!633}
!633 = !DISubrange(count: 12)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "temphead", scope: !2, file: !3, line: 664, type: !636, isLocal: true, isDefinition: true)
!636 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tempnode", file: !3, line: 657, size: 128, elements: !639)
!639 = !{!640, !641, !645, !646}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !638, file: !3, line: 659, baseType: !636, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !638, file: !3, line: 660, baseType: !642, size: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !643, line: 38, baseType: !644)
!643 = !DIFile(filename: "/usr/include/sched.h", directory: "")
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !501, line: 154, baseType: !14)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !638, file: !3, line: 661, baseType: !17, size: 8, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !638, file: !3, line: 662, baseType: !647, offset: 104)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: -1)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 546, type: !652, isLocal: true, isDefinition: true)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 248, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 31)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 548, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 7936, elements: !653)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !660, line: 50, size: 256, elements: !661)
!660 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!661 = !{!662, !663, !664, !666}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !659, file: !660, line: 52, baseType: !524, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !659, file: !660, line: 55, baseType: !14, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !659, file: !660, line: 56, baseType: !665, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !659, file: !660, line: 57, baseType: !14, size: 32, offset: 192)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "sort_types", scope: !2, file: !3, line: 615, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 48, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 6)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "sort_args", scope: !2, file: !3, line: 609, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 448, elements: !676)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!676 = !{!677}
!677 = !DISubrange(count: 7)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "check_types", scope: !2, file: !3, line: 594, type: !680, isLocal: true, isDefinition: true)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 24, elements: !550)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "check_args", scope: !2, file: !3, line: 588, type: !683, isLocal: true, isDefinition: true)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 256, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 4)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "tab", scope: !2, file: !3, line: 347, type: !14, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "temp_dir_alloc", scope: !2, file: !3, line: 331, type: !561, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "temp_dirs", scope: !2, file: !3, line: 325, type: !692, isLocal: true, isDefinition: true)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "eolchar", scope: !2, file: !3, line: 172, type: !17, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "outstat_errno", scope: !697, file: !3, line: 891, type: !14, isLocal: true, isDefinition: true)
!697 = distinct !DISubprogram(name: "get_outstatus", scope: !3, file: !3, line: 889, type: !698, scopeLine: 890, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !18)
!698 = !DISubroutineType(types: !699)
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !702, line: 46, size: 1152, elements: !703)
!702 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!703 = !{!704, !706, !708, !710, !712, !714, !716, !717, !718, !721, !723, !725, !733, !734, !735}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !701, file: !702, line: 48, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !501, line: 145, baseType: !497)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !701, file: !702, line: 53, baseType: !707, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !501, line: 148, baseType: !497)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !701, file: !702, line: 61, baseType: !709, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !501, line: 151, baseType: !497)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !701, file: !702, line: 62, baseType: !711, size: 32, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !501, line: 150, baseType: !6)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !701, file: !702, line: 64, baseType: !713, size: 32, offset: 224)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !501, line: 146, baseType: !6)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !701, file: !702, line: 65, baseType: !715, size: 32, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !501, line: 147, baseType: !6)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !701, file: !702, line: 67, baseType: !14, size: 32, offset: 288)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !701, file: !702, line: 69, baseType: !705, size: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !701, file: !702, line: 74, baseType: !719, size: 64, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !501, line: 152, baseType: !720)
!720 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !701, file: !702, line: 78, baseType: !722, size: 64, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !501, line: 174, baseType: !720)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !701, file: !702, line: 80, baseType: !724, size: 64, offset: 512)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !501, line: 179, baseType: !720)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !701, file: !702, line: 91, baseType: !726, size: 128, offset: 576)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !727, line: 10, size: 128, elements: !728)
!727 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!728 = !{!729, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !726, file: !727, line: 12, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !501, line: 160, baseType: !720)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !726, file: !727, line: 16, baseType: !732, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !501, line: 196, baseType: !720)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !701, file: !702, line: 92, baseType: !726, size: 128, offset: 704)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !701, file: !702, line: 93, baseType: !726, size: 128, offset: 832)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !701, file: !702, line: 106, baseType: !736, size: 192, offset: 960)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, size: 192, elements: !550)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "outstat", scope: !697, file: !3, line: 892, type: !701, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "random_md5_state", scope: !2, file: !3, line: 2089, type: !741, isLocal: true, isDefinition: true)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "md5_ctx", file: !742, line: 69, size: 1248, elements: !743)
!742 = !DIFile(filename: "../lib/md5.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!743 = !{!744, !748, !749, !750, !751, !755, !756}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !741, file: !742, line: 71, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !746, line: 26, baseType: !747)
!746 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !501, line: 42, baseType: !6)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !741, file: !742, line: 72, baseType: !745, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !741, file: !742, line: 73, baseType: !745, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !741, file: !742, line: 74, baseType: !745, size: 32, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !741, file: !742, line: 76, baseType: !752, size: 64, offset: 128)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 64, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 2)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !741, file: !742, line: 77, baseType: !745, size: 32, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !741, file: !742, line: 78, baseType: !757, size: 1024, offset: 224)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 1024, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 32)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "nmerge", scope: !2, file: !3, line: 367, type: !6, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "merge_buffer_size", scope: !2, file: !3, line: 311, type: !561, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "unit_order", scope: !2, file: !3, line: 1873, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 2048, elements: !616)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "proctab", scope: !2, file: !3, line: 678, type: !769, isLocal: true, isDefinition: true)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !771, line: 50, baseType: !772)
!771 = !DIFile(filename: "../lib/hash.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !771, line: 48, flags: DIFlagFwdDecl)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "nprocs", scope: !2, file: !3, line: 698, type: !642, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "temptail", scope: !2, file: !3, line: 665, type: !777, isLocal: true, isDefinition: true)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "slashbase", scope: !780, file: !3, line: 844, type: !783, isLocal: true, isDefinition: true)
!780 = distinct !DISubprogram(name: "create_temp_file", scope: !3, file: !3, line: 842, type: !781, scopeLine: 843, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !18)
!781 = !DISubroutineType(types: !782)
!782 = !{!637, !665, !558}
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 96, elements: !632)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "temp_dir_index", scope: !780, file: !3, line: 845, type: !561, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "size_bound", scope: !788, file: !3, line: 1519, type: !561, isLocal: true, isDefinition: true)
!788 = distinct !DISubprogram(name: "sort_buffer_size", scope: !3, file: !3, line: 1513, type: !789, scopeLine: 1516, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !18)
!789 = !DISubroutineType(types: !790)
!790 = !{!561, !791, !561, !845, !561, !561}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !795, line: 7, baseType: !796)
!795 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !797, line: 49, size: 1728, elements: !798)
!797 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !814, !816, !817, !818, !819, !820, !822, !826, !829, !831, !834, !837, !838, !839, !840, !841}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !796, file: !797, line: 51, baseType: !14, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !796, file: !797, line: 54, baseType: !16, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !796, file: !797, line: 55, baseType: !16, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !796, file: !797, line: 56, baseType: !16, size: 64, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !796, file: !797, line: 57, baseType: !16, size: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !796, file: !797, line: 58, baseType: !16, size: 64, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !796, file: !797, line: 59, baseType: !16, size: 64, offset: 384)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !796, file: !797, line: 60, baseType: !16, size: 64, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !796, file: !797, line: 61, baseType: !16, size: 64, offset: 512)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !796, file: !797, line: 64, baseType: !16, size: 64, offset: 576)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !796, file: !797, line: 65, baseType: !16, size: 64, offset: 640)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !796, file: !797, line: 66, baseType: !16, size: 64, offset: 704)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !796, file: !797, line: 68, baseType: !812, size: 64, offset: 768)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !797, line: 36, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !796, file: !797, line: 70, baseType: !815, size: 64, offset: 832)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !796, file: !797, line: 72, baseType: !14, size: 32, offset: 896)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !796, file: !797, line: 73, baseType: !14, size: 32, offset: 928)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !796, file: !797, line: 74, baseType: !719, size: 64, offset: 960)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !796, file: !797, line: 77, baseType: !534, size: 16, offset: 1024)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !796, file: !797, line: 78, baseType: !821, size: 8, offset: 1040)
!821 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !796, file: !797, line: 79, baseType: !823, size: 8, offset: 1048)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 1)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !796, file: !797, line: 81, baseType: !827, size: 64, offset: 1088)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !797, line: 43, baseType: null)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !796, file: !797, line: 89, baseType: !830, size: 64, offset: 1152)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !501, line: 153, baseType: !720)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !796, file: !797, line: 91, baseType: !832, size: 64, offset: 1216)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !797, line: 37, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !796, file: !797, line: 92, baseType: !835, size: 64, offset: 1280)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !797, line: 38, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !796, file: !797, line: 93, baseType: !815, size: 64, offset: 1344)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !796, file: !797, line: 94, baseType: !526, size: 64, offset: 1408)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !796, file: !797, line: 95, baseType: !561, size: 64, offset: 1472)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !796, file: !797, line: 96, baseType: !14, size: 32, offset: 1536)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !796, file: !797, line: 98, baseType: !842, size: 160, offset: 1568)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, elements: !843)
!843 = !{!844}
!844 = !DISubrange(count: 20)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "saved_line", scope: !2, file: !3, line: 259, type: !849, isLocal: true, isDefinition: true)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !3, line: 175, size: 256, elements: !850)
!850 = !{!851, !852, !853, !854}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !849, file: !3, line: 177, baseType: !16, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !849, file: !3, line: 178, baseType: !561, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "keybeg", scope: !849, file: !3, line: 179, baseType: !16, size: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "keylim", scope: !849, file: !3, line: 180, baseType: !16, size: 64, offset: 192)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "Version", scope: !857, file: !858, line: 2, type: !524, isLocal: false, isDefinition: true)
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, globals: !859, splitDebugInlining: false, nameTableKind: None)
!858 = !DIFile(filename: "src/version.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!859 = !{!855}
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !862, file: !863, line: 67, type: !867, isLocal: false, isDefinition: true)
!862 = distinct !DICompileUnit(language: DW_LANG_C99, file: !863, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !864, retainedTypes: !865, globals: !866, splitDebugInlining: false, nameTableKind: None)
!863 = !DIFile(filename: "../lib/argmatch.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!864 = !{!29}
!865 = !{!526, !524}
!866 = !{!860}
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !868, line: 61, baseType: !869)
!868 = !DIFile(filename: "../lib/argmatch.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{null}
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "file_name", scope: !874, file: !875, line: 46, type: !524, isLocal: true, isDefinition: true)
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !876, globals: !877, splitDebugInlining: false, nameTableKind: None)
!875 = !DIFile(filename: "../lib/closeout.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!876 = !{!524}
!877 = !{!872, !878}
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !874, file: !875, line: 56, type: !558, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "fillbuf", scope: !882, file: !883, line: 61, type: !887, isLocal: true, isDefinition: true)
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !884, globals: !886, splitDebugInlining: false, nameTableKind: None)
!883 = !DIFile(filename: "../lib/md5.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!884 = !{!16, !524, !885}
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !499, line: 90, baseType: !497)
!886 = !{!880}
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 512, elements: !890)
!888 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !889)
!889 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!890 = !{!891}
!891 = !DISubrange(count: 64)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "exit_failure", scope: !894, file: !895, line: 24, type: !897, isLocal: false, isDefinition: true)
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, globals: !896, splitDebugInlining: false, nameTableKind: None)
!895 = !DIFile(filename: "../lib/exitfail.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!896 = !{!892}
!897 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "default_tuning", scope: !900, file: !901, line: 130, type: !905, isLocal: true, isDefinition: true)
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !902, globals: !904, splitDebugInlining: false, nameTableKind: None)
!901 = !DIFile(filename: "../lib/hash.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!902 = !{!497, !526, !903, !561}
!903 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!904 = !{!898}
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !771, line: 46, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !771, line: 34, size: 160, elements: !908)
!908 = !{!909, !910, !911, !912, !913}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !907, file: !771, line: 39, baseType: !903, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !907, file: !771, line: 40, baseType: !903, size: 32, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !907, file: !771, line: 41, baseType: !903, size: 32, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !907, file: !771, line: 42, baseType: !903, size: 32, offset: 96)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !907, file: !771, line: 43, baseType: !558, size: 8, offset: 128)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "have_pipe2_really", scope: !916, file: !917, line: 55, type: !14, isLocal: true, isDefinition: true)
!916 = distinct !DISubprogram(name: "rpl_pipe2", scope: !917, file: !917, line: 40, type: !918, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !920, retainedNodes: !18)
!917 = !DIFile(filename: "../lib/pipe2.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!918 = !DISubroutineType(types: !919)
!919 = !{!14, !665, !14}
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !917, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, globals: !921, splitDebugInlining: false, nameTableKind: None)
!921 = !{!914}
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "program_name", scope: !924, file: !925, line: 33, type: !524, isLocal: false, isDefinition: true)
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !926, globals: !927, splitDebugInlining: false, nameTableKind: None)
!925 = !DIFile(filename: "../lib/progname.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!926 = !{!526, !16}
!927 = !{!922}
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !930, file: !931, line: 78, type: !971, isLocal: false, isDefinition: true)
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !932, retainedTypes: !938, globals: !939, splitDebugInlining: false, nameTableKind: None)
!931 = !DIFile(filename: "../lib/quotearg.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!932 = !{!29, !933, !52}
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !30, line: 242, baseType: !6, size: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!936 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!937 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!938 = !{!14, !534, !561, !524}
!939 = !{!928, !940, !944, !956, !958, !960, !967, !969}
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !930, file: !931, line: 94, type: !942, isLocal: false, isDefinition: true)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 320, elements: !545)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !930, file: !931, line: 1044, type: !946, isLocal: false, isDefinition: true)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !931, line: 58, size: 448, elements: !947)
!947 = !{!948, !949, !950, !954, !955}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !946, file: !931, line: 61, baseType: !29, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !946, file: !931, line: 64, baseType: !14, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !946, file: !931, line: 68, baseType: !951, size: 256, offset: 64)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 8)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !946, file: !931, line: 71, baseType: !524, size: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !946, file: !931, line: 74, baseType: !524, size: 64, offset: 384)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !930, file: !931, line: 109, type: !946, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "slot0", scope: !930, file: !931, line: 834, type: !624, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "slotvec", scope: !930, file: !931, line: 837, type: !962, isLocal: true, isDefinition: true)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !931, line: 826, size: 128, elements: !964)
!964 = !{!965, !966}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !963, file: !931, line: 828, baseType: !561, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !963, file: !931, line: 829, baseType: !16, size: 64, offset: 64)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "nslots", scope: !930, file: !931, line: 835, type: !14, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "slotvec0", scope: !930, file: !931, line: 836, type: !963, isLocal: true, isDefinition: true)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 704, elements: !540)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !974, file: !975, line: 26, type: !977, isLocal: false, isDefinition: true)
!974 = distinct !DICompileUnit(language: DW_LANG_C99, file: !975, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, globals: !976, splitDebugInlining: false, nameTableKind: None)
!975 = !DIFile(filename: "../lib/version-etc-fsf.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!976 = !{!972}
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 376, elements: !978)
!978 = !{!979}
!979 = !DISubrange(count: 47)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !982, file: !983, line: 509, type: !14, isLocal: true, isDefinition: true)
!982 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !983, file: !983, line: 488, type: !984, scopeLine: 489, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !986, retainedNodes: !18)
!983 = !DIFile(filename: "../lib/fcntl.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!984 = !DISubroutineType(types: !985)
!985 = !{!14, !14, !14}
!986 = distinct !DICompileUnit(language: DW_LANG_C99, file: !983, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, globals: !987, splitDebugInlining: false, nameTableKind: None)
!987 = !{!980}
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !990, file: !991, line: 350, type: !869, isLocal: false, isDefinition: true)
!990 = distinct !DICompileUnit(language: DW_LANG_C99, file: !991, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !992, globals: !993, splitDebugInlining: false, nameTableKind: None)
!991 = !DIFile(filename: "../lib/obstack.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!992 = !{!16, !526, !524}
!993 = !{!988}
!994 = distinct !DICompileUnit(language: DW_LANG_C99, file: !995, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !996, splitDebugInlining: false, nameTableKind: None)
!995 = !DIFile(filename: "../lib/fadvise.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!996 = !{!483}
!997 = distinct !DICompileUnit(language: DW_LANG_C99, file: !998, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !999, splitDebugInlining: false, nameTableKind: None)
!998 = !DIFile(filename: "../lib/filevercmp.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!999 = !{!14}
!1000 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1001, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1001 = !DIFile(filename: "../lib/hard-locale.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1002 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1003, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1004, splitDebugInlining: false, nameTableKind: None)
!1003 = !DIFile(filename: "../lib/heap.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1004 = !{!526}
!1005 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1006, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !999, splitDebugInlining: false, nameTableKind: None)
!1006 = !DIFile(filename: "../lib/inttostr.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1007 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1008, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1009, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "../lib/uinttostr.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1009 = !{!6}
!1010 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1011, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1012, splitDebugInlining: false, nameTableKind: None)
!1011 = !DIFile(filename: "../lib/umaxtostr.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1012 = !{!498}
!1013 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1014, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1015, retainedTypes: !1016, splitDebugInlining: false, nameTableKind: None)
!1014 = !DIFile(filename: "../lib/mbswidth.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1015 = !{!52}
!1016 = !{!561, !889, !14, !534}
!1017 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1018, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1019, retainedTypes: !1004, splitDebugInlining: false, nameTableKind: None)
!1018 = !DIFile(filename: "../lib/nproc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1019 = !{!43, !1020}
!1020 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1021, line: 71, baseType: !6, size: 32, elements: !1022)
!1021 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/confname.h", directory: "")
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237}
!1023 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0, isUnsigned: true)
!1024 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1, isUnsigned: true)
!1025 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2, isUnsigned: true)
!1026 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3, isUnsigned: true)
!1027 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4, isUnsigned: true)
!1028 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5, isUnsigned: true)
!1029 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6, isUnsigned: true)
!1030 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7, isUnsigned: true)
!1031 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8, isUnsigned: true)
!1032 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9, isUnsigned: true)
!1033 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10, isUnsigned: true)
!1034 = !DIEnumerator(name: "_SC_TIMERS", value: 11, isUnsigned: true)
!1035 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12, isUnsigned: true)
!1036 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13, isUnsigned: true)
!1037 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14, isUnsigned: true)
!1038 = !DIEnumerator(name: "_SC_FSYNC", value: 15, isUnsigned: true)
!1039 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16, isUnsigned: true)
!1040 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17, isUnsigned: true)
!1041 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18, isUnsigned: true)
!1042 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19, isUnsigned: true)
!1043 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20, isUnsigned: true)
!1044 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21, isUnsigned: true)
!1045 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22, isUnsigned: true)
!1046 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23, isUnsigned: true)
!1047 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24, isUnsigned: true)
!1048 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25, isUnsigned: true)
!1049 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26, isUnsigned: true)
!1050 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27, isUnsigned: true)
!1051 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28, isUnsigned: true)
!1052 = !DIEnumerator(name: "_SC_VERSION", value: 29, isUnsigned: true)
!1053 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30, isUnsigned: true)
!1054 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31, isUnsigned: true)
!1055 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32, isUnsigned: true)
!1056 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33, isUnsigned: true)
!1057 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34, isUnsigned: true)
!1058 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35, isUnsigned: true)
!1059 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36, isUnsigned: true)
!1060 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37, isUnsigned: true)
!1061 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38, isUnsigned: true)
!1062 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39, isUnsigned: true)
!1063 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40, isUnsigned: true)
!1064 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41, isUnsigned: true)
!1065 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42, isUnsigned: true)
!1066 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43, isUnsigned: true)
!1067 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44, isUnsigned: true)
!1068 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45, isUnsigned: true)
!1069 = !DIEnumerator(name: "_SC_2_VERSION", value: 46, isUnsigned: true)
!1070 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47, isUnsigned: true)
!1071 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48, isUnsigned: true)
!1072 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49, isUnsigned: true)
!1073 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50, isUnsigned: true)
!1074 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51, isUnsigned: true)
!1075 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52, isUnsigned: true)
!1076 = !DIEnumerator(name: "_SC_PII", value: 53, isUnsigned: true)
!1077 = !DIEnumerator(name: "_SC_PII_XTI", value: 54, isUnsigned: true)
!1078 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55, isUnsigned: true)
!1079 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56, isUnsigned: true)
!1080 = !DIEnumerator(name: "_SC_PII_OSI", value: 57, isUnsigned: true)
!1081 = !DIEnumerator(name: "_SC_POLL", value: 58, isUnsigned: true)
!1082 = !DIEnumerator(name: "_SC_SELECT", value: 59, isUnsigned: true)
!1083 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60, isUnsigned: true)
!1084 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60, isUnsigned: true)
!1085 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61, isUnsigned: true)
!1086 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62, isUnsigned: true)
!1087 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63, isUnsigned: true)
!1088 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64, isUnsigned: true)
!1089 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65, isUnsigned: true)
!1090 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66, isUnsigned: true)
!1091 = !DIEnumerator(name: "_SC_THREADS", value: 67, isUnsigned: true)
!1092 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68, isUnsigned: true)
!1093 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69, isUnsigned: true)
!1094 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70, isUnsigned: true)
!1095 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71, isUnsigned: true)
!1096 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72, isUnsigned: true)
!1097 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73, isUnsigned: true)
!1098 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74, isUnsigned: true)
!1099 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75, isUnsigned: true)
!1100 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76, isUnsigned: true)
!1101 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77, isUnsigned: true)
!1102 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78, isUnsigned: true)
!1103 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79, isUnsigned: true)
!1104 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80, isUnsigned: true)
!1105 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81, isUnsigned: true)
!1106 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82, isUnsigned: true)
!1107 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83, isUnsigned: true)
!1108 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84, isUnsigned: true)
!1109 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85, isUnsigned: true)
!1110 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86, isUnsigned: true)
!1111 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87, isUnsigned: true)
!1112 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88, isUnsigned: true)
!1113 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89, isUnsigned: true)
!1114 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90, isUnsigned: true)
!1115 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91, isUnsigned: true)
!1116 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92, isUnsigned: true)
!1117 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93, isUnsigned: true)
!1118 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94, isUnsigned: true)
!1119 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95, isUnsigned: true)
!1120 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96, isUnsigned: true)
!1121 = !DIEnumerator(name: "_SC_2_UPE", value: 97, isUnsigned: true)
!1122 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98, isUnsigned: true)
!1123 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99, isUnsigned: true)
!1124 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100, isUnsigned: true)
!1125 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101, isUnsigned: true)
!1126 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102, isUnsigned: true)
!1127 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103, isUnsigned: true)
!1128 = !DIEnumerator(name: "_SC_INT_MAX", value: 104, isUnsigned: true)
!1129 = !DIEnumerator(name: "_SC_INT_MIN", value: 105, isUnsigned: true)
!1130 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106, isUnsigned: true)
!1131 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107, isUnsigned: true)
!1132 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108, isUnsigned: true)
!1133 = !DIEnumerator(name: "_SC_NZERO", value: 109, isUnsigned: true)
!1134 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110, isUnsigned: true)
!1135 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111, isUnsigned: true)
!1136 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112, isUnsigned: true)
!1137 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113, isUnsigned: true)
!1138 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114, isUnsigned: true)
!1139 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115, isUnsigned: true)
!1140 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116, isUnsigned: true)
!1141 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117, isUnsigned: true)
!1142 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118, isUnsigned: true)
!1143 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119, isUnsigned: true)
!1144 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120, isUnsigned: true)
!1145 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121, isUnsigned: true)
!1146 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122, isUnsigned: true)
!1147 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123, isUnsigned: true)
!1148 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124, isUnsigned: true)
!1149 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125, isUnsigned: true)
!1150 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126, isUnsigned: true)
!1151 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127, isUnsigned: true)
!1152 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128, isUnsigned: true)
!1153 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129, isUnsigned: true)
!1154 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130, isUnsigned: true)
!1155 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131, isUnsigned: true)
!1156 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132, isUnsigned: true)
!1157 = !DIEnumerator(name: "_SC_BARRIERS", value: 133, isUnsigned: true)
!1158 = !DIEnumerator(name: "_SC_BASE", value: 134, isUnsigned: true)
!1159 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135, isUnsigned: true)
!1160 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136, isUnsigned: true)
!1161 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137, isUnsigned: true)
!1162 = !DIEnumerator(name: "_SC_CPUTIME", value: 138, isUnsigned: true)
!1163 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139, isUnsigned: true)
!1164 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140, isUnsigned: true)
!1165 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141, isUnsigned: true)
!1166 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142, isUnsigned: true)
!1167 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143, isUnsigned: true)
!1168 = !DIEnumerator(name: "_SC_FIFO", value: 144, isUnsigned: true)
!1169 = !DIEnumerator(name: "_SC_PIPE", value: 145, isUnsigned: true)
!1170 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146, isUnsigned: true)
!1171 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147, isUnsigned: true)
!1172 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148, isUnsigned: true)
!1173 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149, isUnsigned: true)
!1174 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150, isUnsigned: true)
!1175 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151, isUnsigned: true)
!1176 = !DIEnumerator(name: "_SC_NETWORKING", value: 152, isUnsigned: true)
!1177 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153, isUnsigned: true)
!1178 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154, isUnsigned: true)
!1179 = !DIEnumerator(name: "_SC_REGEXP", value: 155, isUnsigned: true)
!1180 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156, isUnsigned: true)
!1181 = !DIEnumerator(name: "_SC_SHELL", value: 157, isUnsigned: true)
!1182 = !DIEnumerator(name: "_SC_SIGNALS", value: 158, isUnsigned: true)
!1183 = !DIEnumerator(name: "_SC_SPAWN", value: 159, isUnsigned: true)
!1184 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160, isUnsigned: true)
!1185 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161, isUnsigned: true)
!1186 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162, isUnsigned: true)
!1187 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163, isUnsigned: true)
!1188 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164, isUnsigned: true)
!1189 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165, isUnsigned: true)
!1190 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166, isUnsigned: true)
!1191 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167, isUnsigned: true)
!1192 = !DIEnumerator(name: "_SC_2_PBS", value: 168, isUnsigned: true)
!1193 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169, isUnsigned: true)
!1194 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170, isUnsigned: true)
!1195 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171, isUnsigned: true)
!1196 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172, isUnsigned: true)
!1197 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173, isUnsigned: true)
!1198 = !DIEnumerator(name: "_SC_STREAMS", value: 174, isUnsigned: true)
!1199 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175, isUnsigned: true)
!1200 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176, isUnsigned: true)
!1201 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177, isUnsigned: true)
!1202 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178, isUnsigned: true)
!1203 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179, isUnsigned: true)
!1204 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180, isUnsigned: true)
!1205 = !DIEnumerator(name: "_SC_TRACE", value: 181, isUnsigned: true)
!1206 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182, isUnsigned: true)
!1207 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183, isUnsigned: true)
!1208 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184, isUnsigned: true)
!1209 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185, isUnsigned: true)
!1210 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186, isUnsigned: true)
!1211 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187, isUnsigned: true)
!1212 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188, isUnsigned: true)
!1213 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189, isUnsigned: true)
!1214 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190, isUnsigned: true)
!1215 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191, isUnsigned: true)
!1216 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192, isUnsigned: true)
!1217 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193, isUnsigned: true)
!1218 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194, isUnsigned: true)
!1219 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195, isUnsigned: true)
!1220 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196, isUnsigned: true)
!1221 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197, isUnsigned: true)
!1222 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198, isUnsigned: true)
!1223 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199, isUnsigned: true)
!1224 = !DIEnumerator(name: "_SC_IPV6", value: 235, isUnsigned: true)
!1225 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236, isUnsigned: true)
!1226 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237, isUnsigned: true)
!1227 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238, isUnsigned: true)
!1228 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239, isUnsigned: true)
!1229 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240, isUnsigned: true)
!1230 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241, isUnsigned: true)
!1231 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242, isUnsigned: true)
!1232 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243, isUnsigned: true)
!1233 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244, isUnsigned: true)
!1234 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245, isUnsigned: true)
!1235 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246, isUnsigned: true)
!1236 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247, isUnsigned: true)
!1237 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248, isUnsigned: true)
!1238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1239, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1240, retainedTypes: !1241, splitDebugInlining: false, nameTableKind: None)
!1239 = !DIFile(filename: "../lib/physmem.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1240 = !{!1020}
!1241 = !{!1242}
!1242 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1244, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1244 = !DIFile(filename: "../lib/posixver.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1245 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1246, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1247, splitDebugInlining: false, nameTableKind: None)
!1246 = !DIFile(filename: "../lib/randread.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1247 = !{!524, !561}
!1248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1249, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1250, retainedTypes: !1271, splitDebugInlining: false, nameTableKind: None)
!1249 = !DIFile(filename: "../lib/rand-isaac.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1250 = !{!1251}
!1251 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1252, file: !1249, line: 100, baseType: !6, size: 32, elements: !1269)
!1252 = distinct !DISubprogram(name: "isaac_refill", scope: !1249, file: !1249, line: 90, type: !1253, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1248, retainedNodes: !18)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{null, !1255, !1268}
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isaac_state", file: !1257, line: 56, size: 16576, elements: !1258)
!1257 = !DIFile(filename: "../lib/rand-isaac.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1258 = !{!1259, !1265, !1266, !1267}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1256, file: !1257, line: 58, baseType: !1260, size: 16384)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1261, size: 16384, elements: !616)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "isaac_word", file: !1257, line: 44, baseType: !1262)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !499, line: 52, baseType: !1263)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !501, line: 59, baseType: !1264)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !501, line: 45, baseType: !497)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1256, file: !1257, line: 59, baseType: !1261, size: 64, offset: 16384)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1256, file: !1257, line: 59, baseType: !1261, size: 64, offset: 16448)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1256, file: !1257, line: 59, baseType: !1261, size: 64, offset: 16512)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1269 = !{!1270}
!1270 = !DIEnumerator(name: "HALF", value: 128, isUnsigned: true)
!1271 = !{!1261}
!1272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1273, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1274, splitDebugInlining: false, nameTableKind: None)
!1273 = !DIFile(filename: "../lib/readtokens0.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1274 = !{!526, !16, !561, !1275}
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!1276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1277, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1004, splitDebugInlining: false, nameTableKind: None)
!1277 = !DIFile(filename: "../lib/setlocale_null.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1279, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1279 = !DIFile(filename: "../lib/mkstemp-safer.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1281, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1009, splitDebugInlining: false, nameTableKind: None)
!1281 = !DIFile(filename: "../lib/strnumcmp.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1283, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1283 = !DIFile(filename: "../lib/fd-safer.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1284 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1285, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1286, retainedTypes: !1290, splitDebugInlining: false, nameTableKind: None)
!1285 = !DIFile(filename: "../lib/version-etc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1286 = !{!1287}
!1287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1285, line: 40, baseType: !6, size: 32, elements: !1288)
!1288 = !{!1289}
!1289 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2021, isUnsigned: true)
!1290 = !{!524, !526}
!1291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1292, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1293, retainedTypes: !1309, splitDebugInlining: false, nameTableKind: None)
!1292 = !DIFile(filename: "../lib/xmalloc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1293 = !{!1294, !1301}
!1294 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1295, file: !1292, line: 183, baseType: !6, size: 32, elements: !1299)
!1295 = distinct !DISubprogram(name: "x2nrealloc", scope: !1292, file: !1292, line: 171, type: !1296, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1291, retainedNodes: !18)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!526, !526, !1298, !561}
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!1299 = !{!1300}
!1300 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!1301 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1302, file: !1292, line: 225, baseType: !6, size: 32, elements: !1299)
!1302 = distinct !DISubprogram(name: "xpalloc", scope: !1292, file: !1292, line: 218, type: !1303, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1291, retainedNodes: !18)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!526, !526, !1305, !1306, !1308, !1306}
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1307, line: 125, baseType: !1308)
!1307 = !DIFile(filename: "../lib/idx.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !562, line: 35, baseType: !720)
!1309 = !{!16, !526, !1306, !821, !6, !889, !1310, !534, !14, !720, !497, !1311, !1312}
!1310 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1311 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1312 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1314, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !876, splitDebugInlining: false, nameTableKind: None)
!1314 = !DIFile(filename: "../lib/xalloc-die.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1315 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1316, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !864, retainedTypes: !876, splitDebugInlining: false, nameTableKind: None)
!1316 = !DIFile(filename: "../lib/xmemcoll.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1318, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1319, splitDebugInlining: false, nameTableKind: None)
!1318 = !DIFile(filename: "../lib/xnanosleep.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1319 = !{!1320}
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1321, line: 7, baseType: !730)
!1321 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!1322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1323, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1324, retainedTypes: !876, splitDebugInlining: false, nameTableKind: None)
!1323 = !DIFile(filename: "../lib/xstrtol-error.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1324 = !{!453}
!1325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1326, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1327, retainedTypes: !1328, splitDebugInlining: false, nameTableKind: None)
!1326 = !DIFile(filename: "../lib/xstrtoumax.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1327 = !{!453, !52}
!1328 = !{!14, !534}
!1329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1330, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1330 = !DIFile(filename: "../lib/fclose.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1331 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1332, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1004, splitDebugInlining: false, nameTableKind: None)
!1332 = !DIFile(filename: "../lib/fflush.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1334, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1334 = !DIFile(filename: "../lib/free.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1336, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1004, splitDebugInlining: false, nameTableKind: None)
!1336 = !DIFile(filename: "../lib/fseeko.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1337 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1338, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1339, splitDebugInlining: false, nameTableKind: None)
!1338 = !DIFile(filename: "../lib/mbrtowc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1339 = !{!561}
!1340 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1341, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1342, splitDebugInlining: false, nameTableKind: None)
!1341 = !DIFile(filename: "../lib/nanosleep.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1342 = !{!1343}
!1343 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1341, line: 41, baseType: !6, size: 32, elements: !1344)
!1344 = !{!1345}
!1345 = !DIEnumerator(name: "BILLION", value: 1000000000, isUnsigned: true)
!1346 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1347, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1009, splitDebugInlining: false, nameTableKind: None)
!1347 = !DIFile(filename: "../lib/bitrotate.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1349, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1349 = !DIFile(filename: "../lib/c-ctype.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1351, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1352, splitDebugInlining: false, nameTableKind: None)
!1351 = !DIFile(filename: "../lib/c-strcasecmp.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1352 = !{!1353}
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!1354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1355, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1355 = !DIFile(filename: "../lib/close-stream.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1357, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1358, retainedTypes: !1319, splitDebugInlining: false, nameTableKind: None)
!1357 = !DIFile(filename: "../lib/dtotimespec.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1358 = !{!1359}
!1359 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1360, line: 41, baseType: !6, size: 32, elements: !1361)
!1360 = !DIFile(filename: "../lib/timespec.h", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1361 = !{!1362}
!1362 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000, isUnsigned: true)
!1363 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1364, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1364 = !DIFile(filename: "../lib/fd-safer-flag.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1366, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1366 = !DIFile(filename: "../lib/dup-safer-flag.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1368, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1368 = !DIFile(filename: "../lib/fopen-safer.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1370, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !1004, splitDebugInlining: false, nameTableKind: None)
!1370 = !DIFile(filename: "../lib/ialloc.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1372, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1373, retainedTypes: !1004, splitDebugInlining: false, nameTableKind: None)
!1372 = !DIFile(filename: "../lib/localcharset.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1373 = !{!67}
!1374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1375, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1375 = !DIFile(filename: "../lib/memcoll.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1376 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1377, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1377 = !DIFile(filename: "../lib/timespec.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1378 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1379, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false, nameTableKind: None)
!1379 = !DIFile(filename: "../lib/dup-safer.c", directory: "/home/sunyi/Workspaces/Research/snagle-dev/coreutils/obj-llvm")
!1380 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!1381 = !{i32 7, !"Dwarf Version", i32 4}
!1382 = !{i32 2, !"Debug Info Version", i32 3}
!1383 = !{i32 1, !"wchar_size", i32 4}
!1384 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 409, type: !530, scopeLine: 410, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !18)
!1385 = !DILocalVariable(name: "status", arg: 1, scope: !1384, file: !3, line: 409, type: !14)
!1386 = !DILocation(line: 0, scope: !1384)
!1387 = !DILocation(line: 411, column: 14, scope: !1388)
!1388 = distinct !DILexicalBlock(scope: !1384, file: !3, line: 411, column: 7)
!1389 = !DILocation(line: 411, column: 7, scope: !1384)
!1390 = !DILocation(line: 412, column: 5, scope: !1388)
!1391 = !DILocation(line: 412, column: 5, scope: !1392)
!1392 = distinct !DILexicalBlock(scope: !1388, file: !3, line: 412, column: 5)
!1393 = !DILocation(line: 419, column: 15, scope: !1394)
!1394 = distinct !DILexicalBlock(scope: !1388, file: !3, line: 414, column: 5)
!1395 = !DILocation(line: 419, column: 29, scope: !1394)
!1396 = !DILocation(line: 415, column: 7, scope: !1394)
!1397 = !DILocation(line: 420, column: 7, scope: !1394)
!1398 = !DILocation(line: 424, column: 7, scope: !1394)
!1399 = !DILocation(line: 425, column: 7, scope: !1394)
!1400 = !DILocation(line: 427, column: 7, scope: !1394)
!1401 = !DILocation(line: 431, column: 7, scope: !1394)
!1402 = !DILocation(line: 437, column: 7, scope: !1394)
!1403 = !DILocation(line: 442, column: 7, scope: !1394)
!1404 = !DILocation(line: 445, column: 7, scope: !1394)
!1405 = !DILocation(line: 451, column: 7, scope: !1394)
!1406 = !DILocation(line: 459, column: 7, scope: !1394)
!1407 = !DILocation(line: 463, column: 7, scope: !1394)
!1408 = !DILocation(line: 467, column: 7, scope: !1394)
!1409 = !DILocation(line: 474, column: 7, scope: !1394)
!1410 = !DILocation(line: 481, column: 7, scope: !1394)
!1411 = !DILocation(line: 485, column: 7, scope: !1394)
!1412 = !DILocation(line: 491, column: 7, scope: !1394)
!1413 = !DILocation(line: 500, column: 7, scope: !1394)
!1414 = !DILocation(line: 503, column: 7, scope: !1394)
!1415 = !DILocation(line: 504, column: 7, scope: !1394)
!1416 = !DILocation(line: 505, column: 7, scope: !1394)
!1417 = !DILocation(line: 518, column: 7, scope: !1394)
!1418 = !DILocation(line: 526, column: 7, scope: !1394)
!1419 = !DILocation(line: 529, column: 3, scope: !1384)
!1420 = distinct !DISubprogram(name: "emit_stdin_note", scope: !493, file: !493, line: 581, type: !870, scopeLine: 582, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !18)
!1421 = !DILocation(line: 583, column: 3, scope: !1420)
!1422 = !DILocation(line: 586, column: 1, scope: !1420)
!1423 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !493, file: !493, line: 588, type: !870, scopeLine: 589, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !18)
!1424 = !DILocation(line: 590, column: 3, scope: !1423)
!1425 = !DILocation(line: 593, column: 1, scope: !1423)
!1426 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !493, file: !493, line: 634, type: !1427, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !18)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{null, !524}
!1429 = !DILocalVariable(name: "program", arg: 1, scope: !1426, file: !493, line: 634, type: !524)
!1430 = !DILocation(line: 0, scope: !1426)
!1431 = !DILocalVariable(name: "infomap", scope: !1426, file: !493, line: 636, type: !1432)
!1432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1433, size: 896, elements: !676)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1426, file: !493, line: 636, size: 128, elements: !1435)
!1435 = !{!1436, !1437}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1434, file: !493, line: 636, baseType: !524, size: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1434, file: !493, line: 636, baseType: !524, size: 64, offset: 64)
!1438 = !DILocation(line: 636, column: 67, scope: !1426)
!1439 = !DILocalVariable(name: "node", scope: !1426, file: !493, line: 646, type: !524)
!1440 = !DILocation(line: 647, column: 36, scope: !1426)
!1441 = !DILocalVariable(name: "map_prog", scope: !1426, file: !493, line: 647, type: !1442)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1443 = !DILocation(line: 649, column: 3, scope: !1426)
!1444 = !DILocation(line: 649, column: 20, scope: !1426)
!1445 = !DILocation(line: 649, column: 10, scope: !1426)
!1446 = !DILocation(line: 649, column: 28, scope: !1426)
!1447 = !DILocation(line: 649, column: 33, scope: !1426)
!1448 = !DILocation(line: 649, column: 31, scope: !1426)
!1449 = !DILocation(line: 650, column: 13, scope: !1426)
!1450 = distinct !{!1450, !1443, !1449, !1451}
!1451 = !{!"llvm.loop.mustprogress"}
!1452 = !DILocation(line: 652, column: 17, scope: !1453)
!1453 = distinct !DILexicalBlock(scope: !1426, file: !493, line: 652, column: 7)
!1454 = !DILocation(line: 652, column: 7, scope: !1453)
!1455 = !DILocation(line: 652, column: 7, scope: !1426)
!1456 = !DILocation(line: 653, column: 22, scope: !1453)
!1457 = !DILocation(line: 653, column: 5, scope: !1453)
!1458 = !DILocation(line: 655, column: 3, scope: !1426)
!1459 = !DILocation(line: 659, column: 29, scope: !1426)
!1460 = !DILocalVariable(name: "lc_messages", scope: !1426, file: !493, line: 659, type: !524)
!1461 = !DILocation(line: 660, column: 7, scope: !1462)
!1462 = distinct !DILexicalBlock(scope: !1426, file: !493, line: 660, column: 7)
!1463 = !DILocation(line: 660, column: 19, scope: !1462)
!1464 = !DILocation(line: 660, column: 22, scope: !1462)
!1465 = !DILocation(line: 660, column: 7, scope: !1426)
!1466 = !DILocation(line: 666, column: 7, scope: !1467)
!1467 = distinct !DILexicalBlock(scope: !1462, file: !493, line: 661, column: 5)
!1468 = !DILocation(line: 668, column: 5, scope: !1467)
!1469 = !DILocation(line: 669, column: 3, scope: !1426)
!1470 = !DILocation(line: 672, column: 22, scope: !1426)
!1471 = !DILocation(line: 672, column: 17, scope: !1426)
!1472 = !DILocation(line: 671, column: 3, scope: !1426)
!1473 = !DILocation(line: 673, column: 1, scope: !1426)
!1474 = !DILocalVariable(name: "argc", arg: 1, scope: !11, file: !3, line: 4194, type: !14)
!1475 = !DILocation(line: 0, scope: !11)
!1476 = !DILocalVariable(name: "argv", arg: 2, scope: !11, file: !3, line: 4194, type: !15)
!1477 = !DILocalVariable(name: "key_buf", scope: !11, file: !3, line: 4197, type: !576)
!1478 = !DILocation(line: 4197, column: 19, scope: !11)
!1479 = !DILocalVariable(name: "gkey", scope: !11, file: !3, line: 4198, type: !576)
!1480 = !DILocation(line: 4198, column: 19, scope: !11)
!1481 = !DILocalVariable(name: "gkey_only", scope: !11, file: !3, line: 4199, type: !558)
!1482 = !DILocalVariable(name: "c", scope: !11, file: !3, line: 4201, type: !14)
!1483 = !DILocalVariable(name: "checkonly", scope: !11, file: !3, line: 4202, type: !17)
!1484 = !DILocalVariable(name: "mergeonly", scope: !11, file: !3, line: 4203, type: !558)
!1485 = !DILocalVariable(name: "random_source", scope: !11, file: !3, line: 4204, type: !16)
!1486 = !DILocalVariable(name: "need_random", scope: !11, file: !3, line: 4205, type: !558)
!1487 = !DILocalVariable(name: "nthreads", scope: !11, file: !3, line: 4206, type: !561)
!1488 = !DILocalVariable(name: "nfiles", scope: !11, file: !3, line: 4207, type: !561)
!1489 = !DILocation(line: 4208, column: 27, scope: !11)
!1490 = !DILocation(line: 4208, column: 54, scope: !11)
!1491 = !DILocation(line: 4208, column: 8, scope: !11)
!1492 = !DILocalVariable(name: "posixly_correct", scope: !11, file: !3, line: 4208, type: !558)
